Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.5.130/include/proc/p32mk0512gpe064.h
extern volatile __IPC41bits_t IPC41bits __asm__ ("IPC41") __attribute__((section("sfrs"), address(0xBF8103D0)));
extern volatile uint32_t        IPC41CLR __attribute__((section("sfrs"),address(0xBF8103D4)));
extern volatile uint32_t        IPC41SET __attribute__((section("sfrs"),address(0xBF8103D8)));
extern volatile uint32_t        IPC41INV __attribute__((section("sfrs"),address(0xBF8103DC)));
#define IPC42 IPC42
extern volatile uint32_t   IPC42 __attribute__((section("sfrs"), address(0xBF8103E0)));
typedef union {
  struct {
    uint32_t CAN2IS:2;
    uint32_t CAN2IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC42bits_t;
extern volatile __IPC42bits_t IPC42bits __asm__ ("IPC42") __attribute__((section("sfrs"), address(0xBF8103E0)));
extern volatile uint32_t        IPC42CLR __attribute__((section("sfrs"),address(0xBF8103E4)));
extern volatile uint32_t        IPC42SET __attribute__((section("sfrs"),address(0xBF8103E8)));
extern volatile uint32_t        IPC42INV __attribute__((section("sfrs"),address(0xBF8103EC)));
#define IPC43 IPC43
extern volatile uint32_t   IPC43 __attribute__((section("sfrs"), address(0xBF8103F0)));
typedef struct {
  uint32_t w:32;
} __IPC43bits_t;
extern volatile __IPC43bits_t IPC43bits __asm__ ("IPC43") __attribute__((section("sfrs"), address(0xBF8103F0)));
extern volatile uint32_t        IPC43CLR __attribute__((section("sfrs"),address(0xBF8103F4)));
extern volatile uint32_t        IPC43SET __attribute__((section("sfrs"),address(0xBF8103F8)));
extern volatile uint32_t        IPC43INV __attribute__((section("sfrs"),address(0xBF8103FC)));
#define IPC44 IPC44
extern volatile uint32_t   IPC44 __attribute__((section("sfrs"), address(0xBF810400)));
typedef union {
  struct {
    uint32_t :24;
    uint32_t I2C3BIS:2;
    uint32_t I2C3BIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC44bits_t;
extern volatile __IPC44bits_t IPC44bits __asm__ ("IPC44") __attribute__((section("sfrs"), address(0xBF810400)));
extern volatile uint32_t        IPC44CLR __attribute__((section("sfrs"),address(0xBF810404)));
extern volatile uint32_t        IPC44SET __attribute__((section("sfrs"),address(0xBF810408)));
extern volatile uint32_t        IPC44INV __attribute__((section("sfrs"),address(0xBF81040C)));
#define IPC45 IPC45
extern volatile uint32_t   IPC45 __attribute__((section("sfrs"), address(0xBF810410)));
typedef union {
  struct {
    uint32_t I2C3SIS:2;
    uint32_t I2C3SIP:3;
    uint32_t :3;
    uint32_t I2C3MIS:2;
    uint32_t I2C3MIP:3;
    uint32_t :3;
    uint32_t DMA4IS:2;
    uint32_t DMA4IP:3;
    uint32_t :3;
    uint32_t DMA5IS:2;
    uint32_t DMA5IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC45bits_t;
extern volatile __IPC45bits_t IPC45bits __asm__ ("IPC45") __attribute__((section("sfrs"), address(0xBF810410)));
extern volatile uint32_t        IPC45CLR __attribute__((section("sfrs"),address(0xBF810414)));
extern volatile uint32_t        IPC45SET __attribute__((section("sfrs"),address(0xBF810418)));
extern volatile uint32_t        IPC45INV __attribute__((section("sfrs"),address(0xBF81041C)));
#define IPC46 IPC46
extern volatile uint32_t   IPC46 __attribute__((section("sfrs"), address(0xBF810420)));
typedef union {
  struct {
    uint32_t DMA6IS:2;
    uint32_t DMA6IP:3;
    uint32_t :3;
    uint32_t DMA7IS:2;
    uint32_t DMA7IP:3;
    uint32_t :3;
    uint32_t DATAEEIS:2;
    uint32_t DATAEEIP:3;
    uint32_t :3;
    uint32_t CAN3IS:2;
    uint32_t CAN3IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC46bits_t;
extern volatile __IPC46bits_t IPC46bits __asm__ ("IPC46") __attribute__((section("sfrs"), address(0xBF810420)));
extern volatile uint32_t        IPC46CLR __attribute__((section("sfrs"),address(0xBF810424)));
extern volatile uint32_t        IPC46SET __attribute__((section("sfrs"),address(0xBF810428)));
extern volatile uint32_t        IPC46INV __attribute__((section("sfrs"),address(0xBF81042C)));
#define IPC47 IPC47
extern volatile uint32_t   IPC47 __attribute__((section("sfrs"), address(0xBF810430)));
typedef union {
  struct {
    uint32_t CAN4IS:2;
    uint32_t CAN4IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC47bits_t;
extern volatile __IPC47bits_t IPC47bits __asm__ ("IPC47") __attribute__((section("sfrs"), address(0xBF810430)));
extern volatile uint32_t        IPC47CLR __attribute__((section("sfrs"),address(0xBF810434)));
extern volatile uint32_t        IPC47SET __attribute__((section("sfrs"),address(0xBF810438)));
extern volatile uint32_t        IPC47INV __attribute__((section("sfrs"),address(0xBF81043C)));
#define IPC48 IPC48
extern volatile uint32_t   IPC48 __attribute__((section("sfrs"), address(0xBF810440)));
typedef union {
  struct {
    uint32_t :16;
    uint32_t I2C4BIS:2;
    uint32_t I2C4BIP:3;
    uint32_t :3;
    uint32_t I2C4SIS:2;
    uint32_t I2C4SIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC48bits_t;
extern volatile __IPC48bits_t IPC48bits __asm__ ("IPC48") __attribute__((section("sfrs"), address(0xBF810440)));
extern volatile uint32_t        IPC48CLR __attribute__((section("sfrs"),address(0xBF810444)));
extern volatile uint32_t        IPC48SET __attribute__((section("sfrs"),address(0xBF810448)));
extern volatile uint32_t        IPC48INV __attribute__((section("sfrs"),address(0xBF81044C)));
#define IPC49 IPC49
extern volatile uint32_t   IPC49 __attribute__((section("sfrs"), address(0xBF810450)));
typedef union {
  struct {
    uint32_t I2C4MIS:2;
    uint32_t I2C4MIP:3;
    uint32_t :3;
    uint32_t IC10EIS:2;
    uint32_t IC10EIP:3;
    uint32_t :3;
    uint32_t IC10IS:2;
    uint32_t IC10IP:3;
    uint32_t :3;
    uint32_t OC10IS:2;
    uint32_t OC10IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC49bits_t;
extern volatile __IPC49bits_t IPC49bits __asm__ ("IPC49") __attribute__((section("sfrs"), address(0xBF810450)));
extern volatile uint32_t        IPC49CLR __attribute__((section("sfrs"),address(0xBF810454)));
extern volatile uint32_t        IPC49SET __attribute__((section("sfrs"),address(0xBF810458)));
extern volatile uint32_t        IPC49INV __attribute__((section("sfrs"),address(0xBF81045C)));
#define IPC50 IPC50
extern volatile uint32_t   IPC50 __attribute__((section("sfrs"), address(0xBF810460)));
typedef union {
  struct {
    uint32_t IC11EIS:2;
    uint32_t IC11EIP:3;
    uint32_t :3;
    uint32_t IC11IS:2;
    uint32_t IC11IP:3;
    uint32_t :3;
    uint32_t OC11IS:2;
    uint32_t OC11IP:3;
    uint32_t :3;
    uint32_t IC12EIS:2;
    uint32_t IC12EIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC50bits_t;
extern volatile __IPC50bits_t IPC50bits __asm__ ("IPC50") __attribute__((section("sfrs"), address(0xBF810460)));
extern volatile uint32_t        IPC50CLR __attribute__((section("sfrs"),address(0xBF810464)));
extern volatile uint32_t        IPC50SET __attribute__((section("sfrs"),address(0xBF810468)));
extern volatile uint32_t        IPC50INV __attribute__((section("sfrs"),address(0xBF81046C)));
#define IPC51 IPC51
extern volatile uint32_t   IPC51 __attribute__((section("sfrs"), address(0xBF810470)));
typedef union {
  struct {
    uint32_t IC12IS:2;
    uint32_t IC12IP:3;
    uint32_t :3;
    uint32_t OC12IS:2;
    uint32_t OC12IP:3;
    uint32_t :3;
    uint32_t IC13EIS:2;
    uint32_t IC13EIP:3;
    uint32_t :3;
    uint32_t IC13IS:2;
    uint32_t IC13IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC51bits_t;
extern volatile __IPC51bits_t IPC51bits __asm__ ("IPC51") __attribute__((section("sfrs"), address(0xBF810470)));
extern volatile uint32_t        IPC51CLR __attribute__((section("sfrs"),address(0xBF810474)));
extern volatile uint32_t        IPC51SET __attribute__((section("sfrs"),address(0xBF810478)));
extern volatile uint32_t        IPC51INV __attribute__((section("sfrs"),address(0xBF81047C)));
#define IPC52 IPC52
extern volatile uint32_t   IPC52 __attribute__((section("sfrs"), address(0xBF810480)));
typedef union {
  struct {
    uint32_t OC13IS:2;
    uint32_t OC13IP:3;
    uint32_t :3;
    uint32_t IC14EIS:2;
    uint32_t IC14EIP:3;
    uint32_t :3;
    uint32_t IC14IS:2;
    uint32_t IC14IP:3;
    uint32_t :3;
    uint32_t OC14IS:2;
    uint32_t OC14IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC52bits_t;
extern volatile __IPC52bits_t IPC52bits __asm__ ("IPC52") __attribute__((section("sfrs"), address(0xBF810480)));
extern volatile uint32_t        IPC52CLR __attribute__((section("sfrs"),address(0xBF810484)));
extern volatile uint32_t        IPC52SET __attribute__((section("sfrs"),address(0xBF810488)));
extern volatile uint32_t        IPC52INV __attribute__((section("sfrs"),address(0xBF81048C)));
#define IPC53 IPC53
extern volatile uint32_t   IPC53 __attribute__((section("sfrs"), address(0xBF810490)));
typedef union {
  struct {
    uint32_t IC15EIS:2;
    uint32_t IC15EIP:3;
    uint32_t :3;
    uint32_t IC15IS:2;
    uint32_t IC15IP:3;
    uint32_t :3;
    uint32_t OC15IS:2;
    uint32_t OC15IP:3;
    uint32_t :3;
    uint32_t IC16EIS:2;
    uint32_t IC16EIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC53bits_t;
extern volatile __IPC53bits_t IPC53bits __asm__ ("IPC53") __attribute__((section("sfrs"), address(0xBF810490)));
extern volatile uint32_t        IPC53CLR __attribute__((section("sfrs"),address(0xBF810494)));
extern volatile uint32_t        IPC53SET __attribute__((section("sfrs"),address(0xBF810498)));
extern volatile uint32_t        IPC53INV __attribute__((section("sfrs"),address(0xBF81049C)));
#define IPC54 IPC54
extern volatile uint32_t   IPC54 __attribute__((section("sfrs"), address(0xBF8104A0)));
typedef union {
  struct {
    uint32_t IC16IS:2;
    uint32_t IC16IP:3;
    uint32_t :3;
    uint32_t OC16IS:2;
    uint32_t OC16IP:3;
    uint32_t :3;
    uint32_t SPI3EIS:2;
    uint32_t SPI3EIP:3;
    uint32_t :3;
    uint32_t SPI3RXIS:2;
    uint32_t SPI3RXIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC54bits_t;
extern volatile __IPC54bits_t IPC54bits __asm__ ("IPC54") __attribute__((section("sfrs"), address(0xBF8104A0)));
extern volatile uint32_t        IPC54CLR __attribute__((section("sfrs"),address(0xBF8104A4)));
extern volatile uint32_t        IPC54SET __attribute__((section("sfrs"),address(0xBF8104A8)));
extern volatile uint32_t        IPC54INV __attribute__((section("sfrs"),address(0xBF8104AC)));
#define IPC55 IPC55
extern volatile uint32_t   IPC55 __attribute__((section("sfrs"), address(0xBF8104B0)));
typedef union {
  struct {
    uint32_t SPI3TXIS:2;
    uint32_t SPI3TXIP:3;
    uint32_t :3;
    uint32_t SPI4EIS:2;
    uint32_t SPI4EIP:3;
    uint32_t :3;
    uint32_t SPI4RXIS:2;
    uint32_t SPI4RXIP:3;
    uint32_t :3;
    uint32_t SPI4TXIS:2;
    uint32_t SPI4TXIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC55bits_t;
