Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.5.130/include/proc/p32mk0512gpe064.h
extern volatile __ANSELCbits_t ANSELCbits __asm__ ("ANSELC") __attribute__((section("sfrs"), address(0xBF860200)));
extern volatile uint32_t        ANSELCCLR __attribute__((section("sfrs"),address(0xBF860204)));
extern volatile uint32_t        ANSELCSET __attribute__((section("sfrs"),address(0xBF860208)));
extern volatile uint32_t        ANSELCINV __attribute__((section("sfrs"),address(0xBF86020C)));
#define TRISC TRISC
extern volatile uint32_t   TRISC __attribute__((section("sfrs"), address(0xBF860210)));
typedef union {
  struct {
    uint32_t TRISC0:1;
    uint32_t TRISC1:1;
    uint32_t TRISC2:1;
    uint32_t :3;
    uint32_t TRISC6:1;
    uint32_t TRISC7:1;
    uint32_t TRISC8:1;
    uint32_t TRISC9:1;
    uint32_t TRISC10:1;
    uint32_t TRISC11:1;
    uint32_t TRISC12:1;
    uint32_t TRISC13:1;
    uint32_t TRISC14:1;
    uint32_t TRISC15:1;
  };
  struct {
    uint32_t w:32;
  };
} __TRISCbits_t;
extern volatile __TRISCbits_t TRISCbits __asm__ ("TRISC") __attribute__((section("sfrs"), address(0xBF860210)));
extern volatile uint32_t        TRISCCLR __attribute__((section("sfrs"),address(0xBF860214)));
extern volatile uint32_t        TRISCSET __attribute__((section("sfrs"),address(0xBF860218)));
extern volatile uint32_t        TRISCINV __attribute__((section("sfrs"),address(0xBF86021C)));
#define PORTC PORTC
extern volatile uint32_t   PORTC __attribute__((section("sfrs"), address(0xBF860220)));
typedef union {
  struct {
    uint32_t RC0:1;
    uint32_t RC1:1;
    uint32_t RC2:1;
    uint32_t :3;
    uint32_t RC6:1;
    uint32_t RC7:1;
    uint32_t RC8:1;
    uint32_t RC9:1;
    uint32_t RC10:1;
    uint32_t RC11:1;
    uint32_t RC12:1;
    uint32_t RC13:1;
    uint32_t RC14:1;
    uint32_t RC15:1;
  };
  struct {
    uint32_t w:32;
  };
} __PORTCbits_t;
extern volatile __PORTCbits_t PORTCbits __asm__ ("PORTC") __attribute__((section("sfrs"), address(0xBF860220)));
extern volatile uint32_t        PORTCCLR __attribute__((section("sfrs"),address(0xBF860224)));
extern volatile uint32_t        PORTCSET __attribute__((section("sfrs"),address(0xBF860228)));
extern volatile uint32_t        PORTCINV __attribute__((section("sfrs"),address(0xBF86022C)));
#define LATC LATC
extern volatile uint32_t   LATC __attribute__((section("sfrs"), address(0xBF860230)));
typedef union {
  struct {
    uint32_t LATC0:1;
    uint32_t LATC1:1;
    uint32_t LATC2:1;
    uint32_t :3;
    uint32_t LATC6:1;
    uint32_t LATC7:1;
    uint32_t LATC8:1;
    uint32_t LATC9:1;
    uint32_t LATC10:1;
    uint32_t LATC11:1;
    uint32_t LATC12:1;
    uint32_t LATC13:1;
    uint32_t LATC14:1;
    uint32_t LATC15:1;
  };
  struct {
    uint32_t w:32;
  };
} __LATCbits_t;
extern volatile __LATCbits_t LATCbits __asm__ ("LATC") __attribute__((section("sfrs"), address(0xBF860230)));
extern volatile uint32_t        LATCCLR __attribute__((section("sfrs"),address(0xBF860234)));
extern volatile uint32_t        LATCSET __attribute__((section("sfrs"),address(0xBF860238)));
extern volatile uint32_t        LATCINV __attribute__((section("sfrs"),address(0xBF86023C)));
#define ODCC ODCC
extern volatile uint32_t   ODCC __attribute__((section("sfrs"), address(0xBF860240)));
typedef union {
  struct {
    uint32_t ODCC0:1;
    uint32_t ODCC1:1;
    uint32_t ODCC2:1;
    uint32_t :3;
    uint32_t ODCC6:1;
    uint32_t ODCC7:1;
    uint32_t ODCC8:1;
    uint32_t ODCC9:1;
    uint32_t ODCC10:1;
    uint32_t ODCC11:1;
    uint32_t ODCC12:1;
    uint32_t ODCC13:1;
    uint32_t ODCC14:1;
    uint32_t ODCC15:1;
  };
  struct {
    uint32_t w:32;
  };
} __ODCCbits_t;
extern volatile __ODCCbits_t ODCCbits __asm__ ("ODCC") __attribute__((section("sfrs"), address(0xBF860240)));
extern volatile uint32_t        ODCCCLR __attribute__((section("sfrs"),address(0xBF860244)));
extern volatile uint32_t        ODCCSET __attribute__((section("sfrs"),address(0xBF860248)));
extern volatile uint32_t        ODCCINV __attribute__((section("sfrs"),address(0xBF86024C)));
#define CNPUC CNPUC
extern volatile uint32_t   CNPUC __attribute__((section("sfrs"), address(0xBF860250)));
typedef union {
  struct {
    uint32_t CNPUC0:1;
    uint32_t CNPUC1:1;
    uint32_t CNPUC2:1;
    uint32_t :3;
    uint32_t CNPUC6:1;
    uint32_t CNPUC7:1;
    uint32_t CNPUC8:1;
    uint32_t CNPUC9:1;
    uint32_t CNPUC10:1;
    uint32_t CNPUC11:1;
    uint32_t CNPUC12:1;
    uint32_t CNPUC13:1;
    uint32_t CNPUC14:1;
    uint32_t CNPUC15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPUCbits_t;
extern volatile __CNPUCbits_t CNPUCbits __asm__ ("CNPUC") __attribute__((section("sfrs"), address(0xBF860250)));
extern volatile uint32_t        CNPUCCLR __attribute__((section("sfrs"),address(0xBF860254)));
extern volatile uint32_t        CNPUCSET __attribute__((section("sfrs"),address(0xBF860258)));
extern volatile uint32_t        CNPUCINV __attribute__((section("sfrs"),address(0xBF86025C)));
#define CNPDC CNPDC
extern volatile uint32_t   CNPDC __attribute__((section("sfrs"), address(0xBF860260)));
typedef union {
  struct {
    uint32_t CNPDC0:1;
    uint32_t CNPDC1:1;
    uint32_t CNPDC2:1;
    uint32_t :3;
    uint32_t CNPDC6:1;
    uint32_t CNPDC7:1;
    uint32_t CNPDC8:1;
    uint32_t CNPDC9:1;
    uint32_t CNPDC10:1;
    uint32_t CNPDC11:1;
    uint32_t CNPDC12:1;
    uint32_t CNPDC13:1;
    uint32_t CNPDC14:1;
    uint32_t CNPDC15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPDCbits_t;
extern volatile __CNPDCbits_t CNPDCbits __asm__ ("CNPDC") __attribute__((section("sfrs"), address(0xBF860260)));
extern volatile uint32_t        CNPDCCLR __attribute__((section("sfrs"),address(0xBF860264)));
extern volatile uint32_t        CNPDCSET __attribute__((section("sfrs"),address(0xBF860268)));
extern volatile uint32_t        CNPDCINV __attribute__((section("sfrs"),address(0xBF86026C)));
#define CNCONC CNCONC
extern volatile uint32_t   CNCONC __attribute__((section("sfrs"), address(0xBF860270)));
typedef union {
  struct {
    uint32_t :11;
    uint32_t EDGEDETECT:1;
    uint32_t :3;
    uint32_t ON:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNCONCbits_t;
