Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.5.130/include/proc/p32mk0512gpe064.h
extern volatile __C3FLTCON0bits_t C3FLTCON0bits __asm__ ("C3FLTCON0") __attribute__((section("sfrs"), address(0xBF8840C0)));
extern volatile uint32_t        C3FLTCON0CLR __attribute__((section("sfrs"),address(0xBF8840C4)));
extern volatile uint32_t        C3FLTCON0SET __attribute__((section("sfrs"),address(0xBF8840C8)));
extern volatile uint32_t        C3FLTCON0INV __attribute__((section("sfrs"),address(0xBF8840CC)));
#define C3FLTCON1 C3FLTCON1
extern volatile uint32_t   C3FLTCON1 __attribute__((section("sfrs"), address(0xBF8840D0)));
typedef union {
  struct {
    uint32_t FSEL4:5;
    uint32_t MSEL4:2;
    uint32_t FLTEN4:1;
    uint32_t FSEL5:5;
    uint32_t MSEL5:2;
    uint32_t FLTEN5:1;
    uint32_t FSEL6:5;
    uint32_t MSEL6:2;
    uint32_t FLTEN6:1;
    uint32_t FSEL7:5;
    uint32_t MSEL7:2;
    uint32_t FLTEN7:1;
  };
  struct {
    uint32_t w:32;
  };
} __C3FLTCON1bits_t;
extern volatile __C3FLTCON1bits_t C3FLTCON1bits __asm__ ("C3FLTCON1") __attribute__((section("sfrs"), address(0xBF8840D0)));
extern volatile uint32_t        C3FLTCON1CLR __attribute__((section("sfrs"),address(0xBF8840D4)));
extern volatile uint32_t        C3FLTCON1SET __attribute__((section("sfrs"),address(0xBF8840D8)));
extern volatile uint32_t        C3FLTCON1INV __attribute__((section("sfrs"),address(0xBF8840DC)));
#define C3FLTCON2 C3FLTCON2
extern volatile uint32_t   C3FLTCON2 __attribute__((section("sfrs"), address(0xBF8840E0)));
typedef union {
  struct {
    uint32_t FSEL8:5;
    uint32_t MSEL8:2;
    uint32_t FLTEN8:1;
    uint32_t FSEL9:5;
    uint32_t MSEL9:2;
    uint32_t FLTEN9:1;
    uint32_t FSEL10:5;
    uint32_t MSEL10:2;
    uint32_t FLTEN10:1;
    uint32_t FSEL11:5;
    uint32_t MSEL11:2;
    uint32_t FLTEN11:1;
  };
  struct {
    uint32_t w:32;
  };
} __C3FLTCON2bits_t;
extern volatile __C3FLTCON2bits_t C3FLTCON2bits __asm__ ("C3FLTCON2") __attribute__((section("sfrs"), address(0xBF8840E0)));
extern volatile uint32_t        C3FLTCON2CLR __attribute__((section("sfrs"),address(0xBF8840E4)));
extern volatile uint32_t        C3FLTCON2SET __attribute__((section("sfrs"),address(0xBF8840E8)));
extern volatile uint32_t        C3FLTCON2INV __attribute__((section("sfrs"),address(0xBF8840EC)));
#define C3FLTCON3 C3FLTCON3
extern volatile uint32_t   C3FLTCON3 __attribute__((section("sfrs"), address(0xBF8840F0)));
typedef union {
  struct {
    uint32_t FSEL12:5;
    uint32_t MSEL12:2;
    uint32_t FLTEN12:1;
    uint32_t FSEL13:5;
    uint32_t MSEL13:2;
    uint32_t FLTEN13:1;
    uint32_t FSEL14:5;
    uint32_t MSEL14:2;
    uint32_t FLTEN14:1;
    uint32_t FSEL15:5;
    uint32_t MSEL15:2;
    uint32_t FLTEN15:1;
  };
  struct {
    uint32_t w:32;
  };
} __C3FLTCON3bits_t;
extern volatile __C3FLTCON3bits_t C3FLTCON3bits __asm__ ("C3FLTCON3") __attribute__((section("sfrs"), address(0xBF8840F0)));
extern volatile uint32_t        C3FLTCON3CLR __attribute__((section("sfrs"),address(0xBF8840F4)));
extern volatile uint32_t        C3FLTCON3SET __attribute__((section("sfrs"),address(0xBF8840F8)));
extern volatile uint32_t        C3FLTCON3INV __attribute__((section("sfrs"),address(0xBF8840FC)));
#define C3RXF0 C3RXF0
extern volatile uint32_t   C3RXF0 __attribute__((section("sfrs"), address(0xBF884140)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C3RXF0bits_t;
extern volatile __C3RXF0bits_t C3RXF0bits __asm__ ("C3RXF0") __attribute__((section("sfrs"), address(0xBF884140)));
extern volatile uint32_t        C3RXF0CLR __attribute__((section("sfrs"),address(0xBF884144)));
extern volatile uint32_t        C3RXF0SET __attribute__((section("sfrs"),address(0xBF884148)));
extern volatile uint32_t        C3RXF0INV __attribute__((section("sfrs"),address(0xBF88414C)));
#define C3RXF1 C3RXF1
extern volatile uint32_t   C3RXF1 __attribute__((section("sfrs"), address(0xBF884150)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C3RXF1bits_t;
extern volatile __C3RXF1bits_t C3RXF1bits __asm__ ("C3RXF1") __attribute__((section("sfrs"), address(0xBF884150)));
extern volatile uint32_t        C3RXF1CLR __attribute__((section("sfrs"),address(0xBF884154)));
extern volatile uint32_t        C3RXF1SET __attribute__((section("sfrs"),address(0xBF884158)));
extern volatile uint32_t        C3RXF1INV __attribute__((section("sfrs"),address(0xBF88415C)));
#define C3RXF2 C3RXF2
extern volatile uint32_t   C3RXF2 __attribute__((section("sfrs"), address(0xBF884160)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C3RXF2bits_t;
extern volatile __C3RXF2bits_t C3RXF2bits __asm__ ("C3RXF2") __attribute__((section("sfrs"), address(0xBF884160)));
extern volatile uint32_t        C3RXF2CLR __attribute__((section("sfrs"),address(0xBF884164)));
extern volatile uint32_t        C3RXF2SET __attribute__((section("sfrs"),address(0xBF884168)));
extern volatile uint32_t        C3RXF2INV __attribute__((section("sfrs"),address(0xBF88416C)));
#define C3RXF3 C3RXF3
extern volatile uint32_t   C3RXF3 __attribute__((section("sfrs"), address(0xBF884170)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C3RXF3bits_t;
extern volatile __C3RXF3bits_t C3RXF3bits __asm__ ("C3RXF3") __attribute__((section("sfrs"), address(0xBF884170)));
extern volatile uint32_t        C3RXF3CLR __attribute__((section("sfrs"),address(0xBF884174)));
extern volatile uint32_t        C3RXF3SET __attribute__((section("sfrs"),address(0xBF884178)));
extern volatile uint32_t        C3RXF3INV __attribute__((section("sfrs"),address(0xBF88417C)));
#define C3RXF4 C3RXF4
extern volatile uint32_t   C3RXF4 __attribute__((section("sfrs"), address(0xBF884180)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C3RXF4bits_t;
extern volatile __C3RXF4bits_t C3RXF4bits __asm__ ("C3RXF4") __attribute__((section("sfrs"), address(0xBF884180)));
extern volatile uint32_t        C3RXF4CLR __attribute__((section("sfrs"),address(0xBF884184)));
extern volatile uint32_t        C3RXF4SET __attribute__((section("sfrs"),address(0xBF884188)));
extern volatile uint32_t        C3RXF4INV __attribute__((section("sfrs"),address(0xBF88418C)));
#define C3RXF5 C3RXF5
extern volatile uint32_t   C3RXF5 __attribute__((section("sfrs"), address(0xBF884190)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C3RXF5bits_t;
extern volatile __C3RXF5bits_t C3RXF5bits __asm__ ("C3RXF5") __attribute__((section("sfrs"), address(0xBF884190)));
extern volatile uint32_t        C3RXF5CLR __attribute__((section("sfrs"),address(0xBF884194)));
extern volatile uint32_t        C3RXF5SET __attribute__((section("sfrs"),address(0xBF884198)));
extern volatile uint32_t        C3RXF5INV __attribute__((section("sfrs"),address(0xBF88419C)));
#define C3RXF6 C3RXF6
extern volatile uint32_t   C3RXF6 __attribute__((section("sfrs"), address(0xBF8841A0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C3RXF6bits_t;
