Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.5.130/include/proc/p32mk0512gpe064.h
extern volatile __C3RXF6bits_t C3RXF6bits __asm__ ("C3RXF6") __attribute__((section("sfrs"), address(0xBF8841A0)));
extern volatile uint32_t        C3RXF6CLR __attribute__((section("sfrs"),address(0xBF8841A4)));
extern volatile uint32_t        C3RXF6SET __attribute__((section("sfrs"),address(0xBF8841A8)));
extern volatile uint32_t        C3RXF6INV __attribute__((section("sfrs"),address(0xBF8841AC)));
#define C3RXF7 C3RXF7
extern volatile uint32_t   C3RXF7 __attribute__((section("sfrs"), address(0xBF8841B0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C3RXF7bits_t;
extern volatile __C3RXF7bits_t C3RXF7bits __asm__ ("C3RXF7") __attribute__((section("sfrs"), address(0xBF8841B0)));
extern volatile uint32_t        C3RXF7CLR __attribute__((section("sfrs"),address(0xBF8841B4)));
extern volatile uint32_t        C3RXF7SET __attribute__((section("sfrs"),address(0xBF8841B8)));
extern volatile uint32_t        C3RXF7INV __attribute__((section("sfrs"),address(0xBF8841BC)));
#define C3RXF8 C3RXF8
extern volatile uint32_t   C3RXF8 __attribute__((section("sfrs"), address(0xBF8841C0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C3RXF8bits_t;
extern volatile __C3RXF8bits_t C3RXF8bits __asm__ ("C3RXF8") __attribute__((section("sfrs"), address(0xBF8841C0)));
extern volatile uint32_t        C3RXF8CLR __attribute__((section("sfrs"),address(0xBF8841C4)));
extern volatile uint32_t        C3RXF8SET __attribute__((section("sfrs"),address(0xBF8841C8)));
extern volatile uint32_t        C3RXF8INV __attribute__((section("sfrs"),address(0xBF8841CC)));
#define C3RXF9 C3RXF9
extern volatile uint32_t   C3RXF9 __attribute__((section("sfrs"), address(0xBF8841D0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C3RXF9bits_t;
extern volatile __C3RXF9bits_t C3RXF9bits __asm__ ("C3RXF9") __attribute__((section("sfrs"), address(0xBF8841D0)));
extern volatile uint32_t        C3RXF9CLR __attribute__((section("sfrs"),address(0xBF8841D4)));
extern volatile uint32_t        C3RXF9SET __attribute__((section("sfrs"),address(0xBF8841D8)));
extern volatile uint32_t        C3RXF9INV __attribute__((section("sfrs"),address(0xBF8841DC)));
#define C3RXF10 C3RXF10
extern volatile uint32_t   C3RXF10 __attribute__((section("sfrs"), address(0xBF8841E0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C3RXF10bits_t;
extern volatile __C3RXF10bits_t C3RXF10bits __asm__ ("C3RXF10") __attribute__((section("sfrs"), address(0xBF8841E0)));
extern volatile uint32_t        C3RXF10CLR __attribute__((section("sfrs"),address(0xBF8841E4)));
extern volatile uint32_t        C3RXF10SET __attribute__((section("sfrs"),address(0xBF8841E8)));
extern volatile uint32_t        C3RXF10INV __attribute__((section("sfrs"),address(0xBF8841EC)));
#define C3RXF11 C3RXF11
extern volatile uint32_t   C3RXF11 __attribute__((section("sfrs"), address(0xBF8841F0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C3RXF11bits_t;
extern volatile __C3RXF11bits_t C3RXF11bits __asm__ ("C3RXF11") __attribute__((section("sfrs"), address(0xBF8841F0)));
extern volatile uint32_t        C3RXF11CLR __attribute__((section("sfrs"),address(0xBF8841F4)));
extern volatile uint32_t        C3RXF11SET __attribute__((section("sfrs"),address(0xBF8841F8)));
extern volatile uint32_t        C3RXF11INV __attribute__((section("sfrs"),address(0xBF8841FC)));
#define C3RXF12 C3RXF12
extern volatile uint32_t   C3RXF12 __attribute__((section("sfrs"), address(0xBF884200)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C3RXF12bits_t;
extern volatile __C3RXF12bits_t C3RXF12bits __asm__ ("C3RXF12") __attribute__((section("sfrs"), address(0xBF884200)));
extern volatile uint32_t        C3RXF12CLR __attribute__((section("sfrs"),address(0xBF884204)));
extern volatile uint32_t        C3RXF12SET __attribute__((section("sfrs"),address(0xBF884208)));
extern volatile uint32_t        C3RXF12INV __attribute__((section("sfrs"),address(0xBF88420C)));
#define C3RXF13 C3RXF13
extern volatile uint32_t   C3RXF13 __attribute__((section("sfrs"), address(0xBF884210)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C3RXF13bits_t;
extern volatile __C3RXF13bits_t C3RXF13bits __asm__ ("C3RXF13") __attribute__((section("sfrs"), address(0xBF884210)));
extern volatile uint32_t        C3RXF13CLR __attribute__((section("sfrs"),address(0xBF884214)));
extern volatile uint32_t        C3RXF13SET __attribute__((section("sfrs"),address(0xBF884218)));
extern volatile uint32_t        C3RXF13INV __attribute__((section("sfrs"),address(0xBF88421C)));
#define C3RXF14 C3RXF14
extern volatile uint32_t   C3RXF14 __attribute__((section("sfrs"), address(0xBF884220)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C3RXF14bits_t;
extern volatile __C3RXF14bits_t C3RXF14bits __asm__ ("C3RXF14") __attribute__((section("sfrs"), address(0xBF884220)));
extern volatile uint32_t        C3RXF14CLR __attribute__((section("sfrs"),address(0xBF884224)));
extern volatile uint32_t        C3RXF14SET __attribute__((section("sfrs"),address(0xBF884228)));
extern volatile uint32_t        C3RXF14INV __attribute__((section("sfrs"),address(0xBF88422C)));
#define C3RXF15 C3RXF15
extern volatile uint32_t   C3RXF15 __attribute__((section("sfrs"), address(0xBF884230)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C3RXF15bits_t;
