Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.5.130/include/proc/p32mk0512gpe064.h
extern volatile __C3FIFOCI4bits_t C3FIFOCI4bits __asm__ ("C3FIFOCI4") __attribute__((section("sfrs"), address(0xBF884480)));
extern volatile uint32_t        C3FIFOCI4CLR __attribute__((section("sfrs"),address(0xBF884484)));
extern volatile uint32_t        C3FIFOCI4SET __attribute__((section("sfrs"),address(0xBF884488)));
extern volatile uint32_t        C3FIFOCI4INV __attribute__((section("sfrs"),address(0xBF88448C)));
#define C3FIFOCON5 C3FIFOCON5
extern volatile uint32_t   C3FIFOCON5 __attribute__((section("sfrs"), address(0xBF884490)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C3FIFOCON5bits_t;
extern volatile __C3FIFOCON5bits_t C3FIFOCON5bits __asm__ ("C3FIFOCON5") __attribute__((section("sfrs"), address(0xBF884490)));
extern volatile uint32_t        C3FIFOCON5CLR __attribute__((section("sfrs"),address(0xBF884494)));
extern volatile uint32_t        C3FIFOCON5SET __attribute__((section("sfrs"),address(0xBF884498)));
extern volatile uint32_t        C3FIFOCON5INV __attribute__((section("sfrs"),address(0xBF88449C)));
#define C3FIFOINT5 C3FIFOINT5
extern volatile uint32_t   C3FIFOINT5 __attribute__((section("sfrs"), address(0xBF8844A0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C3FIFOINT5bits_t;
extern volatile __C3FIFOINT5bits_t C3FIFOINT5bits __asm__ ("C3FIFOINT5") __attribute__((section("sfrs"), address(0xBF8844A0)));
extern volatile uint32_t        C3FIFOINT5CLR __attribute__((section("sfrs"),address(0xBF8844A4)));
extern volatile uint32_t        C3FIFOINT5SET __attribute__((section("sfrs"),address(0xBF8844A8)));
extern volatile uint32_t        C3FIFOINT5INV __attribute__((section("sfrs"),address(0xBF8844AC)));
#define C3FIFOUA5 C3FIFOUA5
extern volatile uint32_t   C3FIFOUA5 __attribute__((section("sfrs"), address(0xBF8844B0)));
extern volatile uint32_t        C3FIFOUA5CLR __attribute__((section("sfrs"),address(0xBF8844B4)));
extern volatile uint32_t        C3FIFOUA5SET __attribute__((section("sfrs"),address(0xBF8844B8)));
extern volatile uint32_t        C3FIFOUA5INV __attribute__((section("sfrs"),address(0xBF8844BC)));
#define C3FIFOCI5 C3FIFOCI5
extern volatile uint32_t   C3FIFOCI5 __attribute__((section("sfrs"), address(0xBF8844C0)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C3FIFOCI5bits_t;
extern volatile __C3FIFOCI5bits_t C3FIFOCI5bits __asm__ ("C3FIFOCI5") __attribute__((section("sfrs"), address(0xBF8844C0)));
extern volatile uint32_t        C3FIFOCI5CLR __attribute__((section("sfrs"),address(0xBF8844C4)));
extern volatile uint32_t        C3FIFOCI5SET __attribute__((section("sfrs"),address(0xBF8844C8)));
extern volatile uint32_t        C3FIFOCI5INV __attribute__((section("sfrs"),address(0xBF8844CC)));
#define C3FIFOCON6 C3FIFOCON6
extern volatile uint32_t   C3FIFOCON6 __attribute__((section("sfrs"), address(0xBF8844D0)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C3FIFOCON6bits_t;
extern volatile __C3FIFOCON6bits_t C3FIFOCON6bits __asm__ ("C3FIFOCON6") __attribute__((section("sfrs"), address(0xBF8844D0)));
extern volatile uint32_t        C3FIFOCON6CLR __attribute__((section("sfrs"),address(0xBF8844D4)));
extern volatile uint32_t        C3FIFOCON6SET __attribute__((section("sfrs"),address(0xBF8844D8)));
extern volatile uint32_t        C3FIFOCON6INV __attribute__((section("sfrs"),address(0xBF8844DC)));
#define C3FIFOINT6 C3FIFOINT6
extern volatile uint32_t   C3FIFOINT6 __attribute__((section("sfrs"), address(0xBF8844E0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C3FIFOINT6bits_t;
extern volatile __C3FIFOINT6bits_t C3FIFOINT6bits __asm__ ("C3FIFOINT6") __attribute__((section("sfrs"), address(0xBF8844E0)));
extern volatile uint32_t        C3FIFOINT6CLR __attribute__((section("sfrs"),address(0xBF8844E4)));
extern volatile uint32_t        C3FIFOINT6SET __attribute__((section("sfrs"),address(0xBF8844E8)));
extern volatile uint32_t        C3FIFOINT6INV __attribute__((section("sfrs"),address(0xBF8844EC)));
#define C3FIFOUA6 C3FIFOUA6
extern volatile uint32_t   C3FIFOUA6 __attribute__((section("sfrs"), address(0xBF8844F0)));
extern volatile uint32_t        C3FIFOUA6CLR __attribute__((section("sfrs"),address(0xBF8844F4)));
extern volatile uint32_t        C3FIFOUA6SET __attribute__((section("sfrs"),address(0xBF8844F8)));
extern volatile uint32_t        C3FIFOUA6INV __attribute__((section("sfrs"),address(0xBF8844FC)));
#define C3FIFOCI6 C3FIFOCI6
extern volatile uint32_t   C3FIFOCI6 __attribute__((section("sfrs"), address(0xBF884500)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C3FIFOCI6bits_t;
extern volatile __C3FIFOCI6bits_t C3FIFOCI6bits __asm__ ("C3FIFOCI6") __attribute__((section("sfrs"), address(0xBF884500)));
extern volatile uint32_t        C3FIFOCI6CLR __attribute__((section("sfrs"),address(0xBF884504)));
extern volatile uint32_t        C3FIFOCI6SET __attribute__((section("sfrs"),address(0xBF884508)));
extern volatile uint32_t        C3FIFOCI6INV __attribute__((section("sfrs"),address(0xBF88450C)));
#define C3FIFOCON7 C3FIFOCON7
extern volatile uint32_t   C3FIFOCON7 __attribute__((section("sfrs"), address(0xBF884510)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C3FIFOCON7bits_t;
extern volatile __C3FIFOCON7bits_t C3FIFOCON7bits __asm__ ("C3FIFOCON7") __attribute__((section("sfrs"), address(0xBF884510)));
extern volatile uint32_t        C3FIFOCON7CLR __attribute__((section("sfrs"),address(0xBF884514)));
extern volatile uint32_t        C3FIFOCON7SET __attribute__((section("sfrs"),address(0xBF884518)));
extern volatile uint32_t        C3FIFOCON7INV __attribute__((section("sfrs"),address(0xBF88451C)));
#define C3FIFOINT7 C3FIFOINT7
extern volatile uint32_t   C3FIFOINT7 __attribute__((section("sfrs"), address(0xBF884520)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C3FIFOINT7bits_t;
