Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.5.130/include/proc/p32mk0512gpe064.h
extern volatile __C3FIFOINT7bits_t C3FIFOINT7bits __asm__ ("C3FIFOINT7") __attribute__((section("sfrs"), address(0xBF884520)));
extern volatile uint32_t        C3FIFOINT7CLR __attribute__((section("sfrs"),address(0xBF884524)));
extern volatile uint32_t        C3FIFOINT7SET __attribute__((section("sfrs"),address(0xBF884528)));
extern volatile uint32_t        C3FIFOINT7INV __attribute__((section("sfrs"),address(0xBF88452C)));
#define C3FIFOUA7 C3FIFOUA7
extern volatile uint32_t   C3FIFOUA7 __attribute__((section("sfrs"), address(0xBF884530)));
extern volatile uint32_t        C3FIFOUA7CLR __attribute__((section("sfrs"),address(0xBF884534)));
extern volatile uint32_t        C3FIFOUA7SET __attribute__((section("sfrs"),address(0xBF884538)));
extern volatile uint32_t        C3FIFOUA7INV __attribute__((section("sfrs"),address(0xBF88453C)));
#define C3FIFOCI7 C3FIFOCI7
extern volatile uint32_t   C3FIFOCI7 __attribute__((section("sfrs"), address(0xBF884540)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C3FIFOCI7bits_t;
extern volatile __C3FIFOCI7bits_t C3FIFOCI7bits __asm__ ("C3FIFOCI7") __attribute__((section("sfrs"), address(0xBF884540)));
extern volatile uint32_t        C3FIFOCI7CLR __attribute__((section("sfrs"),address(0xBF884544)));
extern volatile uint32_t        C3FIFOCI7SET __attribute__((section("sfrs"),address(0xBF884548)));
extern volatile uint32_t        C3FIFOCI7INV __attribute__((section("sfrs"),address(0xBF88454C)));
#define C3FIFOCON8 C3FIFOCON8
extern volatile uint32_t   C3FIFOCON8 __attribute__((section("sfrs"), address(0xBF884550)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C3FIFOCON8bits_t;
extern volatile __C3FIFOCON8bits_t C3FIFOCON8bits __asm__ ("C3FIFOCON8") __attribute__((section("sfrs"), address(0xBF884550)));
extern volatile uint32_t        C3FIFOCON8CLR __attribute__((section("sfrs"),address(0xBF884554)));
extern volatile uint32_t        C3FIFOCON8SET __attribute__((section("sfrs"),address(0xBF884558)));
extern volatile uint32_t        C3FIFOCON8INV __attribute__((section("sfrs"),address(0xBF88455C)));
#define C3FIFOINT8 C3FIFOINT8
extern volatile uint32_t   C3FIFOINT8 __attribute__((section("sfrs"), address(0xBF884560)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C3FIFOINT8bits_t;
extern volatile __C3FIFOINT8bits_t C3FIFOINT8bits __asm__ ("C3FIFOINT8") __attribute__((section("sfrs"), address(0xBF884560)));
extern volatile uint32_t        C3FIFOINT8CLR __attribute__((section("sfrs"),address(0xBF884564)));
extern volatile uint32_t        C3FIFOINT8SET __attribute__((section("sfrs"),address(0xBF884568)));
extern volatile uint32_t        C3FIFOINT8INV __attribute__((section("sfrs"),address(0xBF88456C)));
#define C3FIFOUA8 C3FIFOUA8
extern volatile uint32_t   C3FIFOUA8 __attribute__((section("sfrs"), address(0xBF884570)));
extern volatile uint32_t        C3FIFOUA8CLR __attribute__((section("sfrs"),address(0xBF884574)));
extern volatile uint32_t        C3FIFOUA8SET __attribute__((section("sfrs"),address(0xBF884578)));
extern volatile uint32_t        C3FIFOUA8INV __attribute__((section("sfrs"),address(0xBF88457C)));
#define C3FIFOCI8 C3FIFOCI8
extern volatile uint32_t   C3FIFOCI8 __attribute__((section("sfrs"), address(0xBF884580)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C3FIFOCI8bits_t;
extern volatile __C3FIFOCI8bits_t C3FIFOCI8bits __asm__ ("C3FIFOCI8") __attribute__((section("sfrs"), address(0xBF884580)));
extern volatile uint32_t        C3FIFOCI8CLR __attribute__((section("sfrs"),address(0xBF884584)));
extern volatile uint32_t        C3FIFOCI8SET __attribute__((section("sfrs"),address(0xBF884588)));
extern volatile uint32_t        C3FIFOCI8INV __attribute__((section("sfrs"),address(0xBF88458C)));
#define C3FIFOCON9 C3FIFOCON9
extern volatile uint32_t   C3FIFOCON9 __attribute__((section("sfrs"), address(0xBF884590)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C3FIFOCON9bits_t;
extern volatile __C3FIFOCON9bits_t C3FIFOCON9bits __asm__ ("C3FIFOCON9") __attribute__((section("sfrs"), address(0xBF884590)));
extern volatile uint32_t        C3FIFOCON9CLR __attribute__((section("sfrs"),address(0xBF884594)));
extern volatile uint32_t        C3FIFOCON9SET __attribute__((section("sfrs"),address(0xBF884598)));
extern volatile uint32_t        C3FIFOCON9INV __attribute__((section("sfrs"),address(0xBF88459C)));
#define C3FIFOINT9 C3FIFOINT9
extern volatile uint32_t   C3FIFOINT9 __attribute__((section("sfrs"), address(0xBF8845A0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C3FIFOINT9bits_t;
extern volatile __C3FIFOINT9bits_t C3FIFOINT9bits __asm__ ("C3FIFOINT9") __attribute__((section("sfrs"), address(0xBF8845A0)));
extern volatile uint32_t        C3FIFOINT9CLR __attribute__((section("sfrs"),address(0xBF8845A4)));
extern volatile uint32_t        C3FIFOINT9SET __attribute__((section("sfrs"),address(0xBF8845A8)));
extern volatile uint32_t        C3FIFOINT9INV __attribute__((section("sfrs"),address(0xBF8845AC)));
#define C3FIFOUA9 C3FIFOUA9
extern volatile uint32_t   C3FIFOUA9 __attribute__((section("sfrs"), address(0xBF8845B0)));
extern volatile uint32_t        C3FIFOUA9CLR __attribute__((section("sfrs"),address(0xBF8845B4)));
extern volatile uint32_t        C3FIFOUA9SET __attribute__((section("sfrs"),address(0xBF8845B8)));
extern volatile uint32_t        C3FIFOUA9INV __attribute__((section("sfrs"),address(0xBF8845BC)));
#define C3FIFOCI9 C3FIFOCI9
extern volatile uint32_t   C3FIFOCI9 __attribute__((section("sfrs"), address(0xBF8845C0)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C3FIFOCI9bits_t;
extern volatile __C3FIFOCI9bits_t C3FIFOCI9bits __asm__ ("C3FIFOCI9") __attribute__((section("sfrs"), address(0xBF8845C0)));
extern volatile uint32_t        C3FIFOCI9CLR __attribute__((section("sfrs"),address(0xBF8845C4)));
extern volatile uint32_t        C3FIFOCI9SET __attribute__((section("sfrs"),address(0xBF8845C8)));
extern volatile uint32_t        C3FIFOCI9INV __attribute__((section("sfrs"),address(0xBF8845CC)));
#define C3FIFOCON10 C3FIFOCON10
extern volatile uint32_t   C3FIFOCON10 __attribute__((section("sfrs"), address(0xBF8845D0)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C3FIFOCON10bits_t;
extern volatile __C3FIFOCON10bits_t C3FIFOCON10bits __asm__ ("C3FIFOCON10") __attribute__((section("sfrs"), address(0xBF8845D0)));
extern volatile uint32_t        C3FIFOCON10CLR __attribute__((section("sfrs"),address(0xBF8845D4)));
extern volatile uint32_t        C3FIFOCON10SET __attribute__((section("sfrs"),address(0xBF8845D8)));
extern volatile uint32_t        C3FIFOCON10INV __attribute__((section("sfrs"),address(0xBF8845DC)));
#define C3FIFOINT10 C3FIFOINT10
extern volatile uint32_t   C3FIFOINT10 __attribute__((section("sfrs"), address(0xBF8845E0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C3FIFOINT10bits_t;
extern volatile __C3FIFOINT10bits_t C3FIFOINT10bits __asm__ ("C3FIFOINT10") __attribute__((section("sfrs"), address(0xBF8845E0)));
extern volatile uint32_t        C3FIFOINT10CLR __attribute__((section("sfrs"),address(0xBF8845E4)));
extern volatile uint32_t        C3FIFOINT10SET __attribute__((section("sfrs"),address(0xBF8845E8)));
extern volatile uint32_t        C3FIFOINT10INV __attribute__((section("sfrs"),address(0xBF8845EC)));
#define C3FIFOUA10 C3FIFOUA10
extern volatile uint32_t   C3FIFOUA10 __attribute__((section("sfrs"), address(0xBF8845F0)));
extern volatile uint32_t        C3FIFOUA10CLR __attribute__((section("sfrs"),address(0xBF8845F4)));
extern volatile uint32_t        C3FIFOUA10SET __attribute__((section("sfrs"),address(0xBF8845F8)));
extern volatile uint32_t        C3FIFOUA10INV __attribute__((section("sfrs"),address(0xBF8845FC)));
#define C3FIFOCI10 C3FIFOCI10
extern volatile uint32_t   C3FIFOCI10 __attribute__((section("sfrs"), address(0xBF884600)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C3FIFOCI10bits_t;
extern volatile __C3FIFOCI10bits_t C3FIFOCI10bits __asm__ ("C3FIFOCI10") __attribute__((section("sfrs"), address(0xBF884600)));
extern volatile uint32_t        C3FIFOCI10CLR __attribute__((section("sfrs"),address(0xBF884604)));
extern volatile uint32_t        C3FIFOCI10SET __attribute__((section("sfrs"),address(0xBF884608)));
extern volatile uint32_t        C3FIFOCI10INV __attribute__((section("sfrs"),address(0xBF88460C)));
#define C3FIFOCON11 C3FIFOCON11
extern volatile uint32_t   C3FIFOCON11 __attribute__((section("sfrs"), address(0xBF884610)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C3FIFOCON11bits_t;
extern volatile __C3FIFOCON11bits_t C3FIFOCON11bits __asm__ ("C3FIFOCON11") __attribute__((section("sfrs"), address(0xBF884610)));
extern volatile uint32_t        C3FIFOCON11CLR __attribute__((section("sfrs"),address(0xBF884614)));
extern volatile uint32_t        C3FIFOCON11SET __attribute__((section("sfrs"),address(0xBF884618)));
extern volatile uint32_t        C3FIFOCON11INV __attribute__((section("sfrs"),address(0xBF88461C)));
#define C3FIFOINT11 C3FIFOINT11
extern volatile uint32_t   C3FIFOINT11 __attribute__((section("sfrs"), address(0xBF884620)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C3FIFOINT11bits_t;
