Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.5.130/include/proc/p32mk0512gpe064.h
extern volatile __C4CONbits_t C4CONbits __asm__ ("C4CON") __attribute__((section("sfrs"), address(0xBF885000)));
extern volatile uint32_t        C4CONCLR __attribute__((section("sfrs"),address(0xBF885004)));
extern volatile uint32_t        C4CONSET __attribute__((section("sfrs"),address(0xBF885008)));
extern volatile uint32_t        C4CONINV __attribute__((section("sfrs"),address(0xBF88500C)));
#define C4CFG C4CFG
extern volatile uint32_t   C4CFG __attribute__((section("sfrs"), address(0xBF885010)));
typedef union {
  struct {
    uint32_t BRP:6;
    uint32_t SJW:2;
    uint32_t PRSEG:3;
    uint32_t SEG1PH:3;
    uint32_t SAM:1;
    uint32_t SEG2PHTS:1;
    uint32_t SEG2PH:3;
    uint32_t :3;
    uint32_t WAKFIL:1;
  };
  struct {
    uint32_t w:32;
  };
} __C4CFGbits_t;
extern volatile __C4CFGbits_t C4CFGbits __asm__ ("C4CFG") __attribute__((section("sfrs"), address(0xBF885010)));
extern volatile uint32_t        C4CFGCLR __attribute__((section("sfrs"),address(0xBF885014)));
extern volatile uint32_t        C4CFGSET __attribute__((section("sfrs"),address(0xBF885018)));
extern volatile uint32_t        C4CFGINV __attribute__((section("sfrs"),address(0xBF88501C)));
#define C4INT C4INT
extern volatile uint32_t   C4INT __attribute__((section("sfrs"), address(0xBF885020)));
typedef union {
  struct {
    uint32_t TBIF:1;
    uint32_t RBIF:1;
    uint32_t CTMRIF:1;
    uint32_t MODIF:1;
    uint32_t :7;
    uint32_t RBOVIF:1;
    uint32_t SERRIF:1;
    uint32_t CERRIF:1;
    uint32_t WAKIF:1;
    uint32_t IVRIF:1;
    uint32_t TBIE:1;
    uint32_t RBIE:1;
    uint32_t CTMRIE:1;
    uint32_t MODIE:1;
    uint32_t :7;
    uint32_t RBOVIE:1;
    uint32_t SERRIE:1;
    uint32_t CERRIE:1;
    uint32_t WAKIE:1;
    uint32_t IVRIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C4INTbits_t;
extern volatile __C4INTbits_t C4INTbits __asm__ ("C4INT") __attribute__((section("sfrs"), address(0xBF885020)));
extern volatile uint32_t        C4INTCLR __attribute__((section("sfrs"),address(0xBF885024)));
extern volatile uint32_t        C4INTSET __attribute__((section("sfrs"),address(0xBF885028)));
extern volatile uint32_t        C4INTINV __attribute__((section("sfrs"),address(0xBF88502C)));
#define C4VEC C4VEC
extern volatile uint32_t   C4VEC __attribute__((section("sfrs"), address(0xBF885030)));
typedef union {
  struct {
    uint32_t ICODE:7;
    uint32_t :1;
    uint32_t FILHIT:5;
  };
  struct {
    uint32_t w:32;
  };
} __C4VECbits_t;
extern volatile __C4VECbits_t C4VECbits __asm__ ("C4VEC") __attribute__((section("sfrs"), address(0xBF885030)));
extern volatile uint32_t        C4VECCLR __attribute__((section("sfrs"),address(0xBF885034)));
extern volatile uint32_t        C4VECSET __attribute__((section("sfrs"),address(0xBF885038)));
extern volatile uint32_t        C4VECINV __attribute__((section("sfrs"),address(0xBF88503C)));
#define C4TREC C4TREC
extern volatile uint32_t   C4TREC __attribute__((section("sfrs"), address(0xBF885040)));
typedef union {
  struct {
    uint32_t RERRCNT:8;
    uint32_t TERRCNT:8;
    uint32_t EWARN:1;
    uint32_t RXWARN:1;
    uint32_t TXWARN:1;
    uint32_t RXBP:1;
    uint32_t TXBP:1;
    uint32_t TXBO:1;
  };
  struct {
    uint32_t w:32;
  };
} __C4TRECbits_t;
extern volatile __C4TRECbits_t C4TRECbits __asm__ ("C4TREC") __attribute__((section("sfrs"), address(0xBF885040)));
extern volatile uint32_t        C4TRECCLR __attribute__((section("sfrs"),address(0xBF885044)));
extern volatile uint32_t        C4TRECSET __attribute__((section("sfrs"),address(0xBF885048)));
extern volatile uint32_t        C4TRECINV __attribute__((section("sfrs"),address(0xBF88504C)));
#define C4FSTAT C4FSTAT
extern volatile uint32_t   C4FSTAT __attribute__((section("sfrs"), address(0xBF885050)));
typedef union {
  struct {
    uint32_t FIFOIP:32;
  };
  struct {
    uint32_t FIFOIP0:1;
    uint32_t FIFOIP1:1;
    uint32_t FIFOIP2:1;
    uint32_t FIFOIP3:1;
    uint32_t FIFOIP4:1;
    uint32_t FIFOIP5:1;
    uint32_t FIFOIP6:1;
    uint32_t FIFOIP7:1;
    uint32_t FIFOIP8:1;
    uint32_t FIFOIP9:1;
    uint32_t FIFOIP10:1;
    uint32_t FIFOIP11:1;
    uint32_t FIFOIP12:1;
    uint32_t FIFOIP13:1;
    uint32_t FIFOIP14:1;
    uint32_t FIFOIP15:1;
  };
  struct {
    uint32_t w:32;
  };
} __C4FSTATbits_t;
extern volatile __C4FSTATbits_t C4FSTATbits __asm__ ("C4FSTAT") __attribute__((section("sfrs"), address(0xBF885050)));
extern volatile uint32_t        C4FSTATCLR __attribute__((section("sfrs"),address(0xBF885054)));
extern volatile uint32_t        C4FSTATSET __attribute__((section("sfrs"),address(0xBF885058)));
extern volatile uint32_t        C4FSTATINV __attribute__((section("sfrs"),address(0xBF88505C)));
#define C4RXOVF C4RXOVF
extern volatile uint32_t   C4RXOVF __attribute__((section("sfrs"), address(0xBF885060)));
typedef union {
  struct {
    uint32_t RXOVF:32;
  };
  struct {
    uint32_t RXOVF0:1;
    uint32_t RXOVF1:1;
    uint32_t RXOVF2:1;
    uint32_t RXOVF3:1;
    uint32_t RXOVF4:1;
    uint32_t RXOVF5:1;
    uint32_t RXOVF6:1;
    uint32_t RXOVF7:1;
    uint32_t RXOVF8:1;
    uint32_t RXOVF9:1;
    uint32_t RXOVF10:1;
    uint32_t RXOVF11:1;
    uint32_t RXOVF12:1;
    uint32_t RXOVF13:1;
    uint32_t RXOVF14:1;
    uint32_t RXOVF15:1;
  };
  struct {
    uint32_t w:32;
  };
} __C4RXOVFbits_t;
extern volatile __C4RXOVFbits_t C4RXOVFbits __asm__ ("C4RXOVF") __attribute__((section("sfrs"), address(0xBF885060)));
extern volatile uint32_t        C4RXOVFCLR __attribute__((section("sfrs"),address(0xBF885064)));
extern volatile uint32_t        C4RXOVFSET __attribute__((section("sfrs"),address(0xBF885068)));
extern volatile uint32_t        C4RXOVFINV __attribute__((section("sfrs"),address(0xBF88506C)));
#define C4TMR C4TMR
extern volatile uint32_t   C4TMR __attribute__((section("sfrs"), address(0xBF885070)));
typedef union {
  struct {
    uint32_t CANTSPRE:16;
    uint32_t CANTS:16;
  };
  struct {
    uint32_t w:32;
  };
} __C4TMRbits_t;
extern volatile __C4TMRbits_t C4TMRbits __asm__ ("C4TMR") __attribute__((section("sfrs"), address(0xBF885070)));
extern volatile uint32_t        C4TMRCLR __attribute__((section("sfrs"),address(0xBF885074)));
extern volatile uint32_t        C4TMRSET __attribute__((section("sfrs"),address(0xBF885078)));
extern volatile uint32_t        C4TMRINV __attribute__((section("sfrs"),address(0xBF88507C)));
#define C4RXM0 C4RXM0
extern volatile uint32_t   C4RXM0 __attribute__((section("sfrs"), address(0xBF885080)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t MIDE:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C4RXM0bits_t;
extern volatile __C4RXM0bits_t C4RXM0bits __asm__ ("C4RXM0") __attribute__((section("sfrs"), address(0xBF885080)));
extern volatile uint32_t        C4RXM0CLR __attribute__((section("sfrs"),address(0xBF885084)));
extern volatile uint32_t        C4RXM0SET __attribute__((section("sfrs"),address(0xBF885088)));
extern volatile uint32_t        C4RXM0INV __attribute__((section("sfrs"),address(0xBF88508C)));
#define C4RXM1 C4RXM1
extern volatile uint32_t   C4RXM1 __attribute__((section("sfrs"), address(0xBF885090)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t MIDE:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C4RXM1bits_t;
