Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.5.130/include/proc/p32mk0512gpe064.h
extern volatile __C4RXF14bits_t C4RXF14bits __asm__ ("C4RXF14") __attribute__((section("sfrs"), address(0xBF885220)));
extern volatile uint32_t        C4RXF14CLR __attribute__((section("sfrs"),address(0xBF885224)));
extern volatile uint32_t        C4RXF14SET __attribute__((section("sfrs"),address(0xBF885228)));
extern volatile uint32_t        C4RXF14INV __attribute__((section("sfrs"),address(0xBF88522C)));
#define C4RXF15 C4RXF15
extern volatile uint32_t   C4RXF15 __attribute__((section("sfrs"), address(0xBF885230)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C4RXF15bits_t;
extern volatile __C4RXF15bits_t C4RXF15bits __asm__ ("C4RXF15") __attribute__((section("sfrs"), address(0xBF885230)));
extern volatile uint32_t        C4RXF15CLR __attribute__((section("sfrs"),address(0xBF885234)));
extern volatile uint32_t        C4RXF15SET __attribute__((section("sfrs"),address(0xBF885238)));
extern volatile uint32_t        C4RXF15INV __attribute__((section("sfrs"),address(0xBF88523C)));
#define C4FIFOBA C4FIFOBA
extern volatile uint32_t   C4FIFOBA __attribute__((section("sfrs"), address(0xBF885340)));
extern volatile uint32_t        C4FIFOBACLR __attribute__((section("sfrs"),address(0xBF885344)));
extern volatile uint32_t        C4FIFOBASET __attribute__((section("sfrs"),address(0xBF885348)));
extern volatile uint32_t        C4FIFOBAINV __attribute__((section("sfrs"),address(0xBF88534C)));
#define C4FIFOCON0 C4FIFOCON0
extern volatile uint32_t   C4FIFOCON0 __attribute__((section("sfrs"), address(0xBF885350)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C4FIFOCON0bits_t;
extern volatile __C4FIFOCON0bits_t C4FIFOCON0bits __asm__ ("C4FIFOCON0") __attribute__((section("sfrs"), address(0xBF885350)));
extern volatile uint32_t        C4FIFOCON0CLR __attribute__((section("sfrs"),address(0xBF885354)));
extern volatile uint32_t        C4FIFOCON0SET __attribute__((section("sfrs"),address(0xBF885358)));
extern volatile uint32_t        C4FIFOCON0INV __attribute__((section("sfrs"),address(0xBF88535C)));
#define C4FIFOINT0 C4FIFOINT0
extern volatile uint32_t   C4FIFOINT0 __attribute__((section("sfrs"), address(0xBF885360)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C4FIFOINT0bits_t;
extern volatile __C4FIFOINT0bits_t C4FIFOINT0bits __asm__ ("C4FIFOINT0") __attribute__((section("sfrs"), address(0xBF885360)));
extern volatile uint32_t        C4FIFOINT0CLR __attribute__((section("sfrs"),address(0xBF885364)));
extern volatile uint32_t        C4FIFOINT0SET __attribute__((section("sfrs"),address(0xBF885368)));
extern volatile uint32_t        C4FIFOINT0INV __attribute__((section("sfrs"),address(0xBF88536C)));
#define C4FIFOUA0 C4FIFOUA0
extern volatile uint32_t   C4FIFOUA0 __attribute__((section("sfrs"), address(0xBF885370)));
extern volatile uint32_t        C4FIFOUA0CLR __attribute__((section("sfrs"),address(0xBF885374)));
extern volatile uint32_t        C4FIFOUA0SET __attribute__((section("sfrs"),address(0xBF885378)));
extern volatile uint32_t        C4FIFOUA0INV __attribute__((section("sfrs"),address(0xBF88537C)));
#define C4FIFOCI0 C4FIFOCI0
extern volatile uint32_t   C4FIFOCI0 __attribute__((section("sfrs"), address(0xBF885380)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C4FIFOCI0bits_t;
extern volatile __C4FIFOCI0bits_t C4FIFOCI0bits __asm__ ("C4FIFOCI0") __attribute__((section("sfrs"), address(0xBF885380)));
extern volatile uint32_t        C4FIFOCI0CLR __attribute__((section("sfrs"),address(0xBF885384)));
extern volatile uint32_t        C4FIFOCI0SET __attribute__((section("sfrs"),address(0xBF885388)));
extern volatile uint32_t        C4FIFOCI0INV __attribute__((section("sfrs"),address(0xBF88538C)));
#define C4FIFOCON1 C4FIFOCON1
extern volatile uint32_t   C4FIFOCON1 __attribute__((section("sfrs"), address(0xBF885390)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C4FIFOCON1bits_t;
extern volatile __C4FIFOCON1bits_t C4FIFOCON1bits __asm__ ("C4FIFOCON1") __attribute__((section("sfrs"), address(0xBF885390)));
extern volatile uint32_t        C4FIFOCON1CLR __attribute__((section("sfrs"),address(0xBF885394)));
extern volatile uint32_t        C4FIFOCON1SET __attribute__((section("sfrs"),address(0xBF885398)));
extern volatile uint32_t        C4FIFOCON1INV __attribute__((section("sfrs"),address(0xBF88539C)));
#define C4FIFOINT1 C4FIFOINT1
extern volatile uint32_t   C4FIFOINT1 __attribute__((section("sfrs"), address(0xBF8853A0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C4FIFOINT1bits_t;
extern volatile __C4FIFOINT1bits_t C4FIFOINT1bits __asm__ ("C4FIFOINT1") __attribute__((section("sfrs"), address(0xBF8853A0)));
extern volatile uint32_t        C4FIFOINT1CLR __attribute__((section("sfrs"),address(0xBF8853A4)));
extern volatile uint32_t        C4FIFOINT1SET __attribute__((section("sfrs"),address(0xBF8853A8)));
extern volatile uint32_t        C4FIFOINT1INV __attribute__((section("sfrs"),address(0xBF8853AC)));
#define C4FIFOUA1 C4FIFOUA1
extern volatile uint32_t   C4FIFOUA1 __attribute__((section("sfrs"), address(0xBF8853B0)));
extern volatile uint32_t        C4FIFOUA1CLR __attribute__((section("sfrs"),address(0xBF8853B4)));
extern volatile uint32_t        C4FIFOUA1SET __attribute__((section("sfrs"),address(0xBF8853B8)));
extern volatile uint32_t        C4FIFOUA1INV __attribute__((section("sfrs"),address(0xBF8853BC)));
#define C4FIFOCI1 C4FIFOCI1
extern volatile uint32_t   C4FIFOCI1 __attribute__((section("sfrs"), address(0xBF8853C0)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C4FIFOCI1bits_t;
