Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.5.130/include/proc/p32mk0512gpe064.h
extern volatile __C4FIFOCI1bits_t C4FIFOCI1bits __asm__ ("C4FIFOCI1") __attribute__((section("sfrs"), address(0xBF8853C0)));
extern volatile uint32_t        C4FIFOCI1CLR __attribute__((section("sfrs"),address(0xBF8853C4)));
extern volatile uint32_t        C4FIFOCI1SET __attribute__((section("sfrs"),address(0xBF8853C8)));
extern volatile uint32_t        C4FIFOCI1INV __attribute__((section("sfrs"),address(0xBF8853CC)));
#define C4FIFOCON2 C4FIFOCON2
extern volatile uint32_t   C4FIFOCON2 __attribute__((section("sfrs"), address(0xBF8853D0)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C4FIFOCON2bits_t;
extern volatile __C4FIFOCON2bits_t C4FIFOCON2bits __asm__ ("C4FIFOCON2") __attribute__((section("sfrs"), address(0xBF8853D0)));
extern volatile uint32_t        C4FIFOCON2CLR __attribute__((section("sfrs"),address(0xBF8853D4)));
extern volatile uint32_t        C4FIFOCON2SET __attribute__((section("sfrs"),address(0xBF8853D8)));
extern volatile uint32_t        C4FIFOCON2INV __attribute__((section("sfrs"),address(0xBF8853DC)));
#define C4FIFOINT2 C4FIFOINT2
extern volatile uint32_t   C4FIFOINT2 __attribute__((section("sfrs"), address(0xBF8853E0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C4FIFOINT2bits_t;
extern volatile __C4FIFOINT2bits_t C4FIFOINT2bits __asm__ ("C4FIFOINT2") __attribute__((section("sfrs"), address(0xBF8853E0)));
extern volatile uint32_t        C4FIFOINT2CLR __attribute__((section("sfrs"),address(0xBF8853E4)));
extern volatile uint32_t        C4FIFOINT2SET __attribute__((section("sfrs"),address(0xBF8853E8)));
extern volatile uint32_t        C4FIFOINT2INV __attribute__((section("sfrs"),address(0xBF8853EC)));
#define C4FIFOUA2 C4FIFOUA2
extern volatile uint32_t   C4FIFOUA2 __attribute__((section("sfrs"), address(0xBF8853F0)));
extern volatile uint32_t        C4FIFOUA2CLR __attribute__((section("sfrs"),address(0xBF8853F4)));
extern volatile uint32_t        C4FIFOUA2SET __attribute__((section("sfrs"),address(0xBF8853F8)));
extern volatile uint32_t        C4FIFOUA2INV __attribute__((section("sfrs"),address(0xBF8853FC)));
#define C4FIFOCI2 C4FIFOCI2
extern volatile uint32_t   C4FIFOCI2 __attribute__((section("sfrs"), address(0xBF885400)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C4FIFOCI2bits_t;
extern volatile __C4FIFOCI2bits_t C4FIFOCI2bits __asm__ ("C4FIFOCI2") __attribute__((section("sfrs"), address(0xBF885400)));
extern volatile uint32_t        C4FIFOCI2CLR __attribute__((section("sfrs"),address(0xBF885404)));
extern volatile uint32_t        C4FIFOCI2SET __attribute__((section("sfrs"),address(0xBF885408)));
extern volatile uint32_t        C4FIFOCI2INV __attribute__((section("sfrs"),address(0xBF88540C)));
#define C4FIFOCON3 C4FIFOCON3
extern volatile uint32_t   C4FIFOCON3 __attribute__((section("sfrs"), address(0xBF885410)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C4FIFOCON3bits_t;
extern volatile __C4FIFOCON3bits_t C4FIFOCON3bits __asm__ ("C4FIFOCON3") __attribute__((section("sfrs"), address(0xBF885410)));
extern volatile uint32_t        C4FIFOCON3CLR __attribute__((section("sfrs"),address(0xBF885414)));
extern volatile uint32_t        C4FIFOCON3SET __attribute__((section("sfrs"),address(0xBF885418)));
extern volatile uint32_t        C4FIFOCON3INV __attribute__((section("sfrs"),address(0xBF88541C)));
#define C4FIFOINT3 C4FIFOINT3
extern volatile uint32_t   C4FIFOINT3 __attribute__((section("sfrs"), address(0xBF885420)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C4FIFOINT3bits_t;
extern volatile __C4FIFOINT3bits_t C4FIFOINT3bits __asm__ ("C4FIFOINT3") __attribute__((section("sfrs"), address(0xBF885420)));
extern volatile uint32_t        C4FIFOINT3CLR __attribute__((section("sfrs"),address(0xBF885424)));
extern volatile uint32_t        C4FIFOINT3SET __attribute__((section("sfrs"),address(0xBF885428)));
extern volatile uint32_t        C4FIFOINT3INV __attribute__((section("sfrs"),address(0xBF88542C)));
#define C4FIFOUA3 C4FIFOUA3
extern volatile uint32_t   C4FIFOUA3 __attribute__((section("sfrs"), address(0xBF885430)));
extern volatile uint32_t        C4FIFOUA3CLR __attribute__((section("sfrs"),address(0xBF885434)));
extern volatile uint32_t        C4FIFOUA3SET __attribute__((section("sfrs"),address(0xBF885438)));
extern volatile uint32_t        C4FIFOUA3INV __attribute__((section("sfrs"),address(0xBF88543C)));
#define C4FIFOCI3 C4FIFOCI3
extern volatile uint32_t   C4FIFOCI3 __attribute__((section("sfrs"), address(0xBF885440)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C4FIFOCI3bits_t;
