Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.5.130/include/proc/p32mk0512gpe064.h
extern volatile __C4FIFOCI5bits_t C4FIFOCI5bits __asm__ ("C4FIFOCI5") __attribute__((section("sfrs"), address(0xBF8854C0)));
extern volatile uint32_t        C4FIFOCI5CLR __attribute__((section("sfrs"),address(0xBF8854C4)));
extern volatile uint32_t        C4FIFOCI5SET __attribute__((section("sfrs"),address(0xBF8854C8)));
extern volatile uint32_t        C4FIFOCI5INV __attribute__((section("sfrs"),address(0xBF8854CC)));
#define C4FIFOCON6 C4FIFOCON6
extern volatile uint32_t   C4FIFOCON6 __attribute__((section("sfrs"), address(0xBF8854D0)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C4FIFOCON6bits_t;
extern volatile __C4FIFOCON6bits_t C4FIFOCON6bits __asm__ ("C4FIFOCON6") __attribute__((section("sfrs"), address(0xBF8854D0)));
extern volatile uint32_t        C4FIFOCON6CLR __attribute__((section("sfrs"),address(0xBF8854D4)));
extern volatile uint32_t        C4FIFOCON6SET __attribute__((section("sfrs"),address(0xBF8854D8)));
extern volatile uint32_t        C4FIFOCON6INV __attribute__((section("sfrs"),address(0xBF8854DC)));
#define C4FIFOINT6 C4FIFOINT6
extern volatile uint32_t   C4FIFOINT6 __attribute__((section("sfrs"), address(0xBF8854E0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C4FIFOINT6bits_t;
extern volatile __C4FIFOINT6bits_t C4FIFOINT6bits __asm__ ("C4FIFOINT6") __attribute__((section("sfrs"), address(0xBF8854E0)));
extern volatile uint32_t        C4FIFOINT6CLR __attribute__((section("sfrs"),address(0xBF8854E4)));
extern volatile uint32_t        C4FIFOINT6SET __attribute__((section("sfrs"),address(0xBF8854E8)));
extern volatile uint32_t        C4FIFOINT6INV __attribute__((section("sfrs"),address(0xBF8854EC)));
#define C4FIFOUA6 C4FIFOUA6
extern volatile uint32_t   C4FIFOUA6 __attribute__((section("sfrs"), address(0xBF8854F0)));
extern volatile uint32_t        C4FIFOUA6CLR __attribute__((section("sfrs"),address(0xBF8854F4)));
extern volatile uint32_t        C4FIFOUA6SET __attribute__((section("sfrs"),address(0xBF8854F8)));
extern volatile uint32_t        C4FIFOUA6INV __attribute__((section("sfrs"),address(0xBF8854FC)));
#define C4FIFOCI6 C4FIFOCI6
extern volatile uint32_t   C4FIFOCI6 __attribute__((section("sfrs"), address(0xBF885500)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C4FIFOCI6bits_t;
extern volatile __C4FIFOCI6bits_t C4FIFOCI6bits __asm__ ("C4FIFOCI6") __attribute__((section("sfrs"), address(0xBF885500)));
extern volatile uint32_t        C4FIFOCI6CLR __attribute__((section("sfrs"),address(0xBF885504)));
extern volatile uint32_t        C4FIFOCI6SET __attribute__((section("sfrs"),address(0xBF885508)));
extern volatile uint32_t        C4FIFOCI6INV __attribute__((section("sfrs"),address(0xBF88550C)));
#define C4FIFOCON7 C4FIFOCON7
extern volatile uint32_t   C4FIFOCON7 __attribute__((section("sfrs"), address(0xBF885510)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C4FIFOCON7bits_t;
extern volatile __C4FIFOCON7bits_t C4FIFOCON7bits __asm__ ("C4FIFOCON7") __attribute__((section("sfrs"), address(0xBF885510)));
extern volatile uint32_t        C4FIFOCON7CLR __attribute__((section("sfrs"),address(0xBF885514)));
extern volatile uint32_t        C4FIFOCON7SET __attribute__((section("sfrs"),address(0xBF885518)));
extern volatile uint32_t        C4FIFOCON7INV __attribute__((section("sfrs"),address(0xBF88551C)));
#define C4FIFOINT7 C4FIFOINT7
extern volatile uint32_t   C4FIFOINT7 __attribute__((section("sfrs"), address(0xBF885520)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C4FIFOINT7bits_t;
extern volatile __C4FIFOINT7bits_t C4FIFOINT7bits __asm__ ("C4FIFOINT7") __attribute__((section("sfrs"), address(0xBF885520)));
extern volatile uint32_t        C4FIFOINT7CLR __attribute__((section("sfrs"),address(0xBF885524)));
extern volatile uint32_t        C4FIFOINT7SET __attribute__((section("sfrs"),address(0xBF885528)));
extern volatile uint32_t        C4FIFOINT7INV __attribute__((section("sfrs"),address(0xBF88552C)));
#define C4FIFOUA7 C4FIFOUA7
extern volatile uint32_t   C4FIFOUA7 __attribute__((section("sfrs"), address(0xBF885530)));
extern volatile uint32_t        C4FIFOUA7CLR __attribute__((section("sfrs"),address(0xBF885534)));
extern volatile uint32_t        C4FIFOUA7SET __attribute__((section("sfrs"),address(0xBF885538)));
extern volatile uint32_t        C4FIFOUA7INV __attribute__((section("sfrs"),address(0xBF88553C)));
#define C4FIFOCI7 C4FIFOCI7
extern volatile uint32_t   C4FIFOCI7 __attribute__((section("sfrs"), address(0xBF885540)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C4FIFOCI7bits_t;
extern volatile __C4FIFOCI7bits_t C4FIFOCI7bits __asm__ ("C4FIFOCI7") __attribute__((section("sfrs"), address(0xBF885540)));
extern volatile uint32_t        C4FIFOCI7CLR __attribute__((section("sfrs"),address(0xBF885544)));
extern volatile uint32_t        C4FIFOCI7SET __attribute__((section("sfrs"),address(0xBF885548)));
extern volatile uint32_t        C4FIFOCI7INV __attribute__((section("sfrs"),address(0xBF88554C)));
#define C4FIFOCON8 C4FIFOCON8
extern volatile uint32_t   C4FIFOCON8 __attribute__((section("sfrs"), address(0xBF885550)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C4FIFOCON8bits_t;
