Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.5.130/include/proc/p32mk0512gpe064.h
  .extern C1FIFOINT2CLR    /* 0xBF8803E4 */
  .extern C1FIFOINT2SET    /* 0xBF8803E8 */
  .extern C1FIFOINT2INV    /* 0xBF8803EC */
  .extern C1FIFOUA2        /* 0xBF8803F0 */
  .extern C1FIFOUA2CLR     /* 0xBF8803F4 */
  .extern C1FIFOUA2SET     /* 0xBF8803F8 */
  .extern C1FIFOUA2INV     /* 0xBF8803FC */
  .extern C1FIFOCI2        /* 0xBF880400 */
  .extern C1FIFOCI2CLR     /* 0xBF880404 */
  .extern C1FIFOCI2SET     /* 0xBF880408 */
  .extern C1FIFOCI2INV     /* 0xBF88040C */
  .extern C1FIFOCON3       /* 0xBF880410 */
  .extern C1FIFOCON3CLR    /* 0xBF880414 */
  .extern C1FIFOCON3SET    /* 0xBF880418 */
  .extern C1FIFOCON3INV    /* 0xBF88041C */
  .extern C1FIFOINT3       /* 0xBF880420 */
  .extern C1FIFOINT3CLR    /* 0xBF880424 */
  .extern C1FIFOINT3SET    /* 0xBF880428 */
  .extern C1FIFOINT3INV    /* 0xBF88042C */
  .extern C1FIFOUA3        /* 0xBF880430 */
  .extern C1FIFOUA3CLR     /* 0xBF880434 */
  .extern C1FIFOUA3SET     /* 0xBF880438 */
  .extern C1FIFOUA3INV     /* 0xBF88043C */
  .extern C1FIFOCI3        /* 0xBF880440 */
  .extern C1FIFOCI3CLR     /* 0xBF880444 */
  .extern C1FIFOCI3SET     /* 0xBF880448 */
  .extern C1FIFOCI3INV     /* 0xBF88044C */
  .extern C1FIFOCON4       /* 0xBF880450 */
  .extern C1FIFOCON4CLR    /* 0xBF880454 */
  .extern C1FIFOCON4SET    /* 0xBF880458 */
  .extern C1FIFOCON4INV    /* 0xBF88045C */
  .extern C1FIFOINT4       /* 0xBF880460 */
  .extern C1FIFOINT4CLR    /* 0xBF880464 */
  .extern C1FIFOINT4SET    /* 0xBF880468 */
  .extern C1FIFOINT4INV    /* 0xBF88046C */
  .extern C1FIFOUA4        /* 0xBF880470 */
  .extern C1FIFOUA4CLR     /* 0xBF880474 */
  .extern C1FIFOUA4SET     /* 0xBF880478 */
  .extern C1FIFOUA4INV     /* 0xBF88047C */
  .extern C1FIFOCI4        /* 0xBF880480 */
  .extern C1FIFOCI4CLR     /* 0xBF880484 */
  .extern C1FIFOCI4SET     /* 0xBF880488 */
  .extern C1FIFOCI4INV     /* 0xBF88048C */
  .extern C1FIFOCON5       /* 0xBF880490 */
  .extern C1FIFOCON5CLR    /* 0xBF880494 */
  .extern C1FIFOCON5SET    /* 0xBF880498 */
  .extern C1FIFOCON5INV    /* 0xBF88049C */
  .extern C1FIFOINT5       /* 0xBF8804A0 */
  .extern C1FIFOINT5CLR    /* 0xBF8804A4 */
  .extern C1FIFOINT5SET    /* 0xBF8804A8 */
  .extern C1FIFOINT5INV    /* 0xBF8804AC */
  .extern C1FIFOUA5        /* 0xBF8804B0 */
  .extern C1FIFOUA5CLR     /* 0xBF8804B4 */
  .extern C1FIFOUA5SET     /* 0xBF8804B8 */
  .extern C1FIFOUA5INV     /* 0xBF8804BC */
  .extern C1FIFOCI5        /* 0xBF8804C0 */
  .extern C1FIFOCI5CLR     /* 0xBF8804C4 */
  .extern C1FIFOCI5SET     /* 0xBF8804C8 */
  .extern C1FIFOCI5INV     /* 0xBF8804CC */
  .extern C1FIFOCON6       /* 0xBF8804D0 */
  .extern C1FIFOCON6CLR    /* 0xBF8804D4 */
  .extern C1FIFOCON6SET    /* 0xBF8804D8 */
  .extern C1FIFOCON6INV    /* 0xBF8804DC */
  .extern C1FIFOINT6       /* 0xBF8804E0 */
  .extern C1FIFOINT6CLR    /* 0xBF8804E4 */
  .extern C1FIFOINT6SET    /* 0xBF8804E8 */
  .extern C1FIFOINT6INV    /* 0xBF8804EC */
  .extern C1FIFOUA6        /* 0xBF8804F0 */
  .extern C1FIFOUA6CLR     /* 0xBF8804F4 */
  .extern C1FIFOUA6SET     /* 0xBF8804F8 */
  .extern C1FIFOUA6INV     /* 0xBF8804FC */
  .extern C1FIFOCI6        /* 0xBF880500 */
  .extern C1FIFOCI6CLR     /* 0xBF880504 */
  .extern C1FIFOCI6SET     /* 0xBF880508 */
  .extern C1FIFOCI6INV     /* 0xBF88050C */
  .extern C1FIFOCON7       /* 0xBF880510 */
  .extern C1FIFOCON7CLR    /* 0xBF880514 */
  .extern C1FIFOCON7SET    /* 0xBF880518 */
  .extern C1FIFOCON7INV    /* 0xBF88051C */
  .extern C1FIFOINT7       /* 0xBF880520 */
  .extern C1FIFOINT7CLR    /* 0xBF880524 */
  .extern C1FIFOINT7SET    /* 0xBF880528 */
  .extern C1FIFOINT7INV    /* 0xBF88052C */
  .extern C1FIFOUA7        /* 0xBF880530 */
  .extern C1FIFOUA7CLR     /* 0xBF880534 */
  .extern C1FIFOUA7SET     /* 0xBF880538 */
  .extern C1FIFOUA7INV     /* 0xBF88053C */
  .extern C1FIFOCI7        /* 0xBF880540 */
  .extern C1FIFOCI7CLR     /* 0xBF880544 */
  .extern C1FIFOCI7SET     /* 0xBF880548 */
  .extern C1FIFOCI7INV     /* 0xBF88054C */
  .extern C1FIFOCON8       /* 0xBF880550 */
  .extern C1FIFOCON8CLR    /* 0xBF880554 */
  .extern C1FIFOCON8SET    /* 0xBF880558 */
  .extern C1FIFOCON8INV    /* 0xBF88055C */
  .extern C1FIFOINT8       /* 0xBF880560 */
  .extern C1FIFOINT8CLR    /* 0xBF880564 */
  .extern C1FIFOINT8SET    /* 0xBF880568 */
  .extern C1FIFOINT8INV    /* 0xBF88056C */
  .extern C1FIFOUA8        /* 0xBF880570 */
  .extern C1FIFOUA8CLR     /* 0xBF880574 */
  .extern C1FIFOUA8SET     /* 0xBF880578 */
  .extern C1FIFOUA8INV     /* 0xBF88057C */
  .extern C1FIFOCI8        /* 0xBF880580 */
  .extern C1FIFOCI8CLR     /* 0xBF880584 */
  .extern C1FIFOCI8SET     /* 0xBF880588 */
  .extern C1FIFOCI8INV     /* 0xBF88058C */
  .extern C1FIFOCON9       /* 0xBF880590 */
  .extern C1FIFOCON9CLR    /* 0xBF880594 */
  .extern C1FIFOCON9SET    /* 0xBF880598 */
  .extern C1FIFOCON9INV    /* 0xBF88059C */
  .extern C1FIFOINT9       /* 0xBF8805A0 */
  .extern C1FIFOINT9CLR    /* 0xBF8805A4 */
  .extern C1FIFOINT9SET    /* 0xBF8805A8 */
  .extern C1FIFOINT9INV    /* 0xBF8805AC */
  .extern C1FIFOUA9        /* 0xBF8805B0 */
  .extern C1FIFOUA9CLR     /* 0xBF8805B4 */
  .extern C1FIFOUA9SET     /* 0xBF8805B8 */
  .extern C1FIFOUA9INV     /* 0xBF8805BC */
  .extern C1FIFOCI9        /* 0xBF8805C0 */
  .extern C1FIFOCI9CLR     /* 0xBF8805C4 */
  .extern C1FIFOCI9SET     /* 0xBF8805C8 */
  .extern C1FIFOCI9INV     /* 0xBF8805CC */
  .extern C1FIFOCON10      /* 0xBF8805D0 */
  .extern C1FIFOCON10CLR   /* 0xBF8805D4 */
  .extern C1FIFOCON10SET   /* 0xBF8805D8 */
  .extern C1FIFOCON10INV   /* 0xBF8805DC */
  .extern C1FIFOINT10      /* 0xBF8805E0 */
  .extern C1FIFOINT10CLR   /* 0xBF8805E4 */
  .extern C1FIFOINT10SET   /* 0xBF8805E8 */
  .extern C1FIFOINT10INV   /* 0xBF8805EC */
  .extern C1FIFOUA10       /* 0xBF8805F0 */
  .extern C1FIFOUA10CLR    /* 0xBF8805F4 */
  .extern C1FIFOUA10SET    /* 0xBF8805F8 */
  .extern C1FIFOUA10INV    /* 0xBF8805FC */
  .extern C1FIFOCI10       /* 0xBF880600 */
  .extern C1FIFOCI10CLR    /* 0xBF880604 */
  .extern C1FIFOCI10SET    /* 0xBF880608 */
  .extern C1FIFOCI10INV    /* 0xBF88060C */
  .extern C1FIFOCON11      /* 0xBF880610 */
  .extern C1FIFOCON11CLR   /* 0xBF880614 */
  .extern C1FIFOCON11SET   /* 0xBF880618 */
  .extern C1FIFOCON11INV   /* 0xBF88061C */
  .extern C1FIFOINT11      /* 0xBF880620 */
  .extern C1FIFOINT11CLR   /* 0xBF880624 */
  .extern C1FIFOINT11SET   /* 0xBF880628 */
  .extern C1FIFOINT11INV   /* 0xBF88062C */
  .extern C1FIFOUA11       /* 0xBF880630 */
  .extern C1FIFOUA11CLR    /* 0xBF880634 */
  .extern C1FIFOUA11SET    /* 0xBF880638 */
  .extern C1FIFOUA11INV    /* 0xBF88063C */
  .extern C1FIFOCI11       /* 0xBF880640 */
  .extern C1FIFOCI11CLR    /* 0xBF880644 */
  .extern C1FIFOCI11SET    /* 0xBF880648 */
  .extern C1FIFOCI11INV    /* 0xBF88064C */
  .extern C1FIFOCON12      /* 0xBF880650 */
  .extern C1FIFOCON12CLR   /* 0xBF880654 */
  .extern C1FIFOCON12SET   /* 0xBF880658 */
  .extern C1FIFOCON12INV   /* 0xBF88065C */
  .extern C1FIFOINT12      /* 0xBF880660 */
  .extern C1FIFOINT12CLR   /* 0xBF880664 */
  .extern C1FIFOINT12SET   /* 0xBF880668 */
  .extern C1FIFOINT12INV   /* 0xBF88066C */
  .extern C1FIFOUA12       /* 0xBF880670 */
  .extern C1FIFOUA12CLR    /* 0xBF880674 */
  .extern C1FIFOUA12SET    /* 0xBF880678 */
  .extern C1FIFOUA12INV    /* 0xBF88067C */
  .extern C1FIFOCI12       /* 0xBF880680 */
  .extern C1FIFOCI12CLR    /* 0xBF880684 */
  .extern C1FIFOCI12SET    /* 0xBF880688 */
  .extern C1FIFOCI12INV    /* 0xBF88068C */
  .extern C1FIFOCON13      /* 0xBF880690 */
  .extern C1FIFOCON13CLR   /* 0xBF880694 */
  .extern C1FIFOCON13SET   /* 0xBF880698 */
  .extern C1FIFOCON13INV   /* 0xBF88069C */
  .extern C1FIFOINT13      /* 0xBF8806A0 */
  .extern C1FIFOINT13CLR   /* 0xBF8806A4 */
  .extern C1FIFOINT13SET   /* 0xBF8806A8 */
  .extern C1FIFOINT13INV   /* 0xBF8806AC */
  .extern C1FIFOUA13       /* 0xBF8806B0 */
  .extern C1FIFOUA13CLR    /* 0xBF8806B4 */
  .extern C1FIFOUA13SET    /* 0xBF8806B8 */
  .extern C1FIFOUA13INV    /* 0xBF8806BC */
  .extern C1FIFOCI13       /* 0xBF8806C0 */
  .extern C1FIFOCI13CLR    /* 0xBF8806C4 */
  .extern C1FIFOCI13SET    /* 0xBF8806C8 */
  .extern C1FIFOCI13INV    /* 0xBF8806CC */
  .extern C1FIFOCON14      /* 0xBF8806D0 */
  .extern C1FIFOCON14CLR   /* 0xBF8806D4 */
  .extern C1FIFOCON14SET   /* 0xBF8806D8 */
  .extern C1FIFOCON14INV   /* 0xBF8806DC */
  .extern C1FIFOINT14      /* 0xBF8806E0 */
  .extern C1FIFOINT14CLR   /* 0xBF8806E4 */
  .extern C1FIFOINT14SET   /* 0xBF8806E8 */
  .extern C1FIFOINT14INV   /* 0xBF8806EC */
  .extern C1FIFOUA14       /* 0xBF8806F0 */
  .extern C1FIFOUA14CLR    /* 0xBF8806F4 */
  .extern C1FIFOUA14SET    /* 0xBF8806F8 */
  .extern C1FIFOUA14INV    /* 0xBF8806FC */
  .extern C1FIFOCI14       /* 0xBF880700 */
  .extern C1FIFOCI14CLR    /* 0xBF880704 */
  .extern C1FIFOCI14SET    /* 0xBF880708 */
  .extern C1FIFOCI14INV    /* 0xBF88070C */
  .extern C1FIFOCON15      /* 0xBF880710 */
  .extern C1FIFOCON15CLR   /* 0xBF880714 */
  .extern C1FIFOCON15SET   /* 0xBF880718 */
  .extern C1FIFOCON15INV   /* 0xBF88071C */
  .extern C1FIFOINT15      /* 0xBF880720 */
  .extern C1FIFOINT15CLR   /* 0xBF880724 */
  .extern C1FIFOINT15SET   /* 0xBF880728 */
  .extern C1FIFOINT15INV   /* 0xBF88072C */
  .extern C1FIFOUA15       /* 0xBF880730 */
  .extern C1FIFOUA15CLR    /* 0xBF880734 */
  .extern C1FIFOUA15SET    /* 0xBF880738 */
  .extern C1FIFOUA15INV    /* 0xBF88073C */
  .extern C1FIFOCI15       /* 0xBF880740 */
  .extern C1FIFOCI15CLR    /* 0xBF880744 */
  .extern C1FIFOCI15SET    /* 0xBF880748 */
  .extern C1FIFOCI15INV    /* 0xBF88074C */
  .extern C2CON            /* 0xBF881000 */
  .extern C2CONCLR         /* 0xBF881004 */
  .extern C2CONSET         /* 0xBF881008 */
  .extern C2CONINV         /* 0xBF88100C */
  .extern C2CFG            /* 0xBF881010 */
  .extern C2CFGCLR         /* 0xBF881014 */
  .extern C2CFGSET         /* 0xBF881018 */
  .extern C2CFGINV         /* 0xBF88101C */
  .extern C2INT            /* 0xBF881020 */
  .extern C2INTCLR         /* 0xBF881024 */
  .extern C2INTSET         /* 0xBF881028 */
  .extern C2INTINV         /* 0xBF88102C */
  .extern C2VEC            /* 0xBF881030 */
  .extern C2VECCLR         /* 0xBF881034 */
  .extern C2VECSET         /* 0xBF881038 */
  .extern C2VECINV         /* 0xBF88103C */
  .extern C2TREC           /* 0xBF881040 */
  .extern C2TRECCLR        /* 0xBF881044 */
  .extern C2TRECSET        /* 0xBF881048 */
  .extern C2TRECINV        /* 0xBF88104C */
  .extern C2FSTAT          /* 0xBF881050 */
  .extern C2FSTATCLR       /* 0xBF881054 */
  .extern C2FSTATSET       /* 0xBF881058 */
  .extern C2FSTATINV       /* 0xBF88105C */
  .extern C2RXOVF          /* 0xBF881060 */
  .extern C2RXOVFCLR       /* 0xBF881064 */
  .extern C2RXOVFSET       /* 0xBF881068 */
  .extern C2RXOVFINV       /* 0xBF88106C */
  .extern C2TMR            /* 0xBF881070 */
  .extern C2TMRCLR         /* 0xBF881074 */
  .extern C2TMRSET         /* 0xBF881078 */
  .extern C2TMRINV         /* 0xBF88107C */
  .extern C2RXM0           /* 0xBF881080 */
  .extern C2RXM0CLR        /* 0xBF881084 */
  .extern C2RXM0SET        /* 0xBF881088 */
  .extern C2RXM0INV        /* 0xBF88108C */
  .extern C2RXM1           /* 0xBF881090 */
  .extern C2RXM1CLR        /* 0xBF881094 */
  .extern C2RXM1SET        /* 0xBF881098 */
  .extern C2RXM1INV        /* 0xBF88109C */
  .extern C2RXM2           /* 0xBF8810A0 */
  .extern C2RXM2CLR        /* 0xBF8810A4 */
  .extern C2RXM2SET        /* 0xBF8810A8 */
  .extern C2RXM2INV        /* 0xBF8810AC */
  .extern C2RXM3           /* 0xBF8810B0 */
  .extern C2RXM3CLR        /* 0xBF8810B4 */
  .extern C2RXM3SET        /* 0xBF8810B8 */
  .extern C2RXM3INV        /* 0xBF8810BC */
  .extern C2FLTCON0        /* 0xBF8810C0 */
  .extern C2FLTCON0CLR     /* 0xBF8810C4 */
  .extern C2FLTCON0SET     /* 0xBF8810C8 */
  .extern C2FLTCON0INV     /* 0xBF8810CC */
  .extern C2FLTCON1        /* 0xBF8810D0 */
  .extern C2FLTCON1CLR     /* 0xBF8810D4 */
  .extern C2FLTCON1SET     /* 0xBF8810D8 */
  .extern C2FLTCON1INV     /* 0xBF8810DC */
  .extern C2FLTCON2        /* 0xBF8810E0 */
  .extern C2FLTCON2CLR     /* 0xBF8810E4 */
  .extern C2FLTCON2SET     /* 0xBF8810E8 */
  .extern C2FLTCON2INV     /* 0xBF8810EC */
  .extern C2FLTCON3        /* 0xBF8810F0 */
  .extern C2FLTCON3CLR     /* 0xBF8810F4 */
  .extern C2FLTCON3SET     /* 0xBF8810F8 */
  .extern C2FLTCON3INV     /* 0xBF8810FC */
  .extern C2RXF0           /* 0xBF881140 */
  .extern C2RXF0CLR        /* 0xBF881144 */
  .extern C2RXF0SET        /* 0xBF881148 */
  .extern C2RXF0INV        /* 0xBF88114C */
  .extern C2RXF1           /* 0xBF881150 */
  .extern C2RXF1CLR        /* 0xBF881154 */
  .extern C2RXF1SET        /* 0xBF881158 */
  .extern C2RXF1INV        /* 0xBF88115C */
  .extern C2RXF2           /* 0xBF881160 */
  .extern C2RXF2CLR        /* 0xBF881164 */
  .extern C2RXF2SET        /* 0xBF881168 */
  .extern C2RXF2INV        /* 0xBF88116C */
  .extern C2RXF3           /* 0xBF881170 */
  .extern C2RXF3CLR        /* 0xBF881174 */
  .extern C2RXF3SET        /* 0xBF881178 */
  .extern C2RXF3INV        /* 0xBF88117C */
  .extern C2RXF4           /* 0xBF881180 */
  .extern C2RXF4CLR        /* 0xBF881184 */
  .extern C2RXF4SET        /* 0xBF881188 */
  .extern C2RXF4INV        /* 0xBF88118C */
  .extern C2RXF5           /* 0xBF881190 */
  .extern C2RXF5CLR        /* 0xBF881194 */
  .extern C2RXF5SET        /* 0xBF881198 */
  .extern C2RXF5INV        /* 0xBF88119C */
  .extern C2RXF6           /* 0xBF8811A0 */
  .extern C2RXF6CLR        /* 0xBF8811A4 */
  .extern C2RXF6SET        /* 0xBF8811A8 */
  .extern C2RXF6INV        /* 0xBF8811AC */
  .extern C2RXF7           /* 0xBF8811B0 */
  .extern C2RXF7CLR        /* 0xBF8811B4 */
  .extern C2RXF7SET        /* 0xBF8811B8 */
  .extern C2RXF7INV        /* 0xBF8811BC */
  .extern C2RXF8           /* 0xBF8811C0 */
  .extern C2RXF8CLR        /* 0xBF8811C4 */
  .extern C2RXF8SET        /* 0xBF8811C8 */
  .extern C2RXF8INV        /* 0xBF8811CC */
  .extern C2RXF9           /* 0xBF8811D0 */
  .extern C2RXF9CLR        /* 0xBF8811D4 */
  .extern C2RXF9SET        /* 0xBF8811D8 */
  .extern C2RXF9INV        /* 0xBF8811DC */
  .extern C2RXF10          /* 0xBF8811E0 */
  .extern C2RXF10CLR       /* 0xBF8811E4 */
  .extern C2RXF10SET       /* 0xBF8811E8 */
  .extern C2RXF10INV       /* 0xBF8811EC */
  .extern C2RXF11          /* 0xBF8811F0 */
  .extern C2RXF11CLR       /* 0xBF8811F4 */
  .extern C2RXF11SET       /* 0xBF8811F8 */
  .extern C2RXF11INV       /* 0xBF8811FC */
  .extern C2RXF12          /* 0xBF881200 */
  .extern C2RXF12CLR       /* 0xBF881204 */
  .extern C2RXF12SET       /* 0xBF881208 */
  .extern C2RXF12INV       /* 0xBF88120C */
  .extern C2RXF13          /* 0xBF881210 */
  .extern C2RXF13CLR       /* 0xBF881214 */
  .extern C2RXF13SET       /* 0xBF881218 */
  .extern C2RXF13INV       /* 0xBF88121C */
  .extern C2RXF14          /* 0xBF881220 */
  .extern C2RXF14CLR       /* 0xBF881224 */
  .extern C2RXF14SET       /* 0xBF881228 */
  .extern C2RXF14INV       /* 0xBF88122C */
  .extern C2RXF15          /* 0xBF881230 */
  .extern C2RXF15CLR       /* 0xBF881234 */
  .extern C2RXF15SET       /* 0xBF881238 */
  .extern C2RXF15INV       /* 0xBF88123C */
  .extern C2FIFOBA         /* 0xBF881340 */
  .extern C2FIFOBACLR      /* 0xBF881344 */
  .extern C2FIFOBASET      /* 0xBF881348 */
  .extern C2FIFOBAINV      /* 0xBF88134C */
  .extern C2FIFOCON0       /* 0xBF881350 */
  .extern C2FIFOCON0CLR    /* 0xBF881354 */
  .extern C2FIFOCON0SET    /* 0xBF881358 */
  .extern C2FIFOCON0INV    /* 0xBF88135C */
  .extern C2FIFOINT0       /* 0xBF881360 */
  .extern C2FIFOINT0CLR    /* 0xBF881364 */
  .extern C2FIFOINT0SET    /* 0xBF881368 */
  .extern C2FIFOINT0INV    /* 0xBF88136C */
  .extern C2FIFOUA0        /* 0xBF881370 */
  .extern C2FIFOUA0CLR     /* 0xBF881374 */
  .extern C2FIFOUA0SET     /* 0xBF881378 */
  .extern C2FIFOUA0INV     /* 0xBF88137C */
  .extern C2FIFOCI0        /* 0xBF881380 */
  .extern C2FIFOCI0CLR     /* 0xBF881384 */
  .extern C2FIFOCI0SET     /* 0xBF881388 */
  .extern C2FIFOCI0INV     /* 0xBF88138C */
  .extern C2FIFOCON1       /* 0xBF881390 */
  .extern C2FIFOCON1CLR    /* 0xBF881394 */
  .extern C2FIFOCON1SET    /* 0xBF881398 */
  .extern C2FIFOCON1INV    /* 0xBF88139C */
  .extern C2FIFOINT1       /* 0xBF8813A0 */
  .extern C2FIFOINT1CLR    /* 0xBF8813A4 */
  .extern C2FIFOINT1SET    /* 0xBF8813A8 */
  .extern C2FIFOINT1INV    /* 0xBF8813AC */
  .extern C2FIFOUA1        /* 0xBF8813B0 */
  .extern C2FIFOUA1CLR     /* 0xBF8813B4 */
  .extern C2FIFOUA1SET     /* 0xBF8813B8 */
  .extern C2FIFOUA1INV     /* 0xBF8813BC */
  .extern C2FIFOCI1        /* 0xBF8813C0 */
  .extern C2FIFOCI1CLR     /* 0xBF8813C4 */
  .extern C2FIFOCI1SET     /* 0xBF8813C8 */
  .extern C2FIFOCI1INV     /* 0xBF8813CC */
  .extern C2FIFOCON2       /* 0xBF8813D0 */
  .extern C2FIFOCON2CLR    /* 0xBF8813D4 */
  .extern C2FIFOCON2SET    /* 0xBF8813D8 */
  .extern C2FIFOCON2INV    /* 0xBF8813DC */
  .extern C2FIFOINT2       /* 0xBF8813E0 */
  .extern C2FIFOINT2CLR    /* 0xBF8813E4 */
  .extern C2FIFOINT2SET    /* 0xBF8813E8 */
  .extern C2FIFOINT2INV    /* 0xBF8813EC */
  .extern C2FIFOUA2        /* 0xBF8813F0 */
  .extern C2FIFOUA2CLR     /* 0xBF8813F4 */
  .extern C2FIFOUA2SET     /* 0xBF8813F8 */
  .extern C2FIFOUA2INV     /* 0xBF8813FC */
  .extern C2FIFOCI2        /* 0xBF881400 */
  .extern C2FIFOCI2CLR     /* 0xBF881404 */
  .extern C2FIFOCI2SET     /* 0xBF881408 */
  .extern C2FIFOCI2INV     /* 0xBF88140C */
  .extern C2FIFOCON3       /* 0xBF881410 */
  .extern C2FIFOCON3CLR    /* 0xBF881414 */
  .extern C2FIFOCON3SET    /* 0xBF881418 */
  .extern C2FIFOCON3INV    /* 0xBF88141C */
  .extern C2FIFOINT3       /* 0xBF881420 */
  .extern C2FIFOINT3CLR    /* 0xBF881424 */
  .extern C2FIFOINT3SET    /* 0xBF881428 */
  .extern C2FIFOINT3INV    /* 0xBF88142C */
  .extern C2FIFOUA3        /* 0xBF881430 */
  .extern C2FIFOUA3CLR     /* 0xBF881434 */
  .extern C2FIFOUA3SET     /* 0xBF881438 */
  .extern C2FIFOUA3INV     /* 0xBF88143C */
  .extern C2FIFOCI3        /* 0xBF881440 */
  .extern C2FIFOCI3CLR     /* 0xBF881444 */
  .extern C2FIFOCI3SET     /* 0xBF881448 */
  .extern C2FIFOCI3INV     /* 0xBF88144C */
  .extern C2FIFOCON4       /* 0xBF881450 */
  .extern C2FIFOCON4CLR    /* 0xBF881454 */
  .extern C2FIFOCON4SET    /* 0xBF881458 */
  .extern C2FIFOCON4INV    /* 0xBF88145C */
  .extern C2FIFOINT4       /* 0xBF881460 */
  .extern C2FIFOINT4CLR    /* 0xBF881464 */
  .extern C2FIFOINT4SET    /* 0xBF881468 */
  .extern C2FIFOINT4INV    /* 0xBF88146C */
  .extern C2FIFOUA4        /* 0xBF881470 */
  .extern C2FIFOUA4CLR     /* 0xBF881474 */
  .extern C2FIFOUA4SET     /* 0xBF881478 */
  .extern C2FIFOUA4INV     /* 0xBF88147C */
  .extern C2FIFOCI4        /* 0xBF881480 */
  .extern C2FIFOCI4CLR     /* 0xBF881484 */
  .extern C2FIFOCI4SET     /* 0xBF881488 */
  .extern C2FIFOCI4INV     /* 0xBF88148C */
  .extern C2FIFOCON5       /* 0xBF881490 */
  .extern C2FIFOCON5CLR    /* 0xBF881494 */
  .extern C2FIFOCON5SET    /* 0xBF881498 */
  .extern C2FIFOCON5INV    /* 0xBF88149C */
  .extern C2FIFOINT5       /* 0xBF8814A0 */
  .extern C2FIFOINT5CLR    /* 0xBF8814A4 */
  .extern C2FIFOINT5SET    /* 0xBF8814A8 */
  .extern C2FIFOINT5INV    /* 0xBF8814AC */
  .extern C2FIFOUA5        /* 0xBF8814B0 */
  .extern C2FIFOUA5CLR     /* 0xBF8814B4 */
  .extern C2FIFOUA5SET     /* 0xBF8814B8 */
  .extern C2FIFOUA5INV     /* 0xBF8814BC */
  .extern C2FIFOCI5        /* 0xBF8814C0 */
  .extern C2FIFOCI5CLR     /* 0xBF8814C4 */
  .extern C2FIFOCI5SET     /* 0xBF8814C8 */
  .extern C2FIFOCI5INV     /* 0xBF8814CC */
  .extern C2FIFOCON6       /* 0xBF8814D0 */
  .extern C2FIFOCON6CLR    /* 0xBF8814D4 */
  .extern C2FIFOCON6SET    /* 0xBF8814D8 */
  .extern C2FIFOCON6INV    /* 0xBF8814DC */
  .extern C2FIFOINT6       /* 0xBF8814E0 */
  .extern C2FIFOINT6CLR    /* 0xBF8814E4 */
  .extern C2FIFOINT6SET    /* 0xBF8814E8 */
  .extern C2FIFOINT6INV    /* 0xBF8814EC */
  .extern C2FIFOUA6        /* 0xBF8814F0 */
  .extern C2FIFOUA6CLR     /* 0xBF8814F4 */
  .extern C2FIFOUA6SET     /* 0xBF8814F8 */
  .extern C2FIFOUA6INV     /* 0xBF8814FC */
  .extern C2FIFOCI6        /* 0xBF881500 */
  .extern C2FIFOCI6CLR     /* 0xBF881504 */
  .extern C2FIFOCI6SET     /* 0xBF881508 */
  .extern C2FIFOCI6INV     /* 0xBF88150C */
  .extern C2FIFOCON7       /* 0xBF881510 */
  .extern C2FIFOCON7CLR    /* 0xBF881514 */
  .extern C2FIFOCON7SET    /* 0xBF881518 */
  .extern C2FIFOCON7INV    /* 0xBF88151C */
  .extern C2FIFOINT7       /* 0xBF881520 */
  .extern C2FIFOINT7CLR    /* 0xBF881524 */
  .extern C2FIFOINT7SET    /* 0xBF881528 */
  .extern C2FIFOINT7INV    /* 0xBF88152C */
  .extern C2FIFOUA7        /* 0xBF881530 */
  .extern C2FIFOUA7CLR     /* 0xBF881534 */
  .extern C2FIFOUA7SET     /* 0xBF881538 */
  .extern C2FIFOUA7INV     /* 0xBF88153C */
  .extern C2FIFOCI7        /* 0xBF881540 */
  .extern C2FIFOCI7CLR     /* 0xBF881544 */
  .extern C2FIFOCI7SET     /* 0xBF881548 */
  .extern C2FIFOCI7INV     /* 0xBF88154C */
  .extern C2FIFOCON8       /* 0xBF881550 */
  .extern C2FIFOCON8CLR    /* 0xBF881554 */
  .extern C2FIFOCON8SET    /* 0xBF881558 */
  .extern C2FIFOCON8INV    /* 0xBF88155C */
  .extern C2FIFOINT8       /* 0xBF881560 */
  .extern C2FIFOINT8CLR    /* 0xBF881564 */
  .extern C2FIFOINT8SET    /* 0xBF881568 */
  .extern C2FIFOINT8INV    /* 0xBF88156C */
  .extern C2FIFOUA8        /* 0xBF881570 */
  .extern C2FIFOUA8CLR     /* 0xBF881574 */
  .extern C2FIFOUA8SET     /* 0xBF881578 */
  .extern C2FIFOUA8INV     /* 0xBF88157C */
  .extern C2FIFOCI8        /* 0xBF881580 */
  .extern C2FIFOCI8CLR     /* 0xBF881584 */
  .extern C2FIFOCI8SET     /* 0xBF881588 */
  .extern C2FIFOCI8INV     /* 0xBF88158C */
  .extern C2FIFOCON9       /* 0xBF881590 */
  .extern C2FIFOCON9CLR    /* 0xBF881594 */
  .extern C2FIFOCON9SET    /* 0xBF881598 */
  .extern C2FIFOCON9INV    /* 0xBF88159C */
  .extern C2FIFOINT9       /* 0xBF8815A0 */
  .extern C2FIFOINT9CLR    /* 0xBF8815A4 */
  .extern C2FIFOINT9SET    /* 0xBF8815A8 */
  .extern C2FIFOINT9INV    /* 0xBF8815AC */
  .extern C2FIFOUA9        /* 0xBF8815B0 */
  .extern C2FIFOUA9CLR     /* 0xBF8815B4 */
  .extern C2FIFOUA9SET     /* 0xBF8815B8 */
  .extern C2FIFOUA9INV     /* 0xBF8815BC */
  .extern C2FIFOCI9        /* 0xBF8815C0 */
  .extern C2FIFOCI9CLR     /* 0xBF8815C4 */
  .extern C2FIFOCI9SET     /* 0xBF8815C8 */
  .extern C2FIFOCI9INV     /* 0xBF8815CC */
  .extern C2FIFOCON10      /* 0xBF8815D0 */
  .extern C2FIFOCON10CLR   /* 0xBF8815D4 */
  .extern C2FIFOCON10SET   /* 0xBF8815D8 */
  .extern C2FIFOCON10INV   /* 0xBF8815DC */
  .extern C2FIFOINT10      /* 0xBF8815E0 */
  .extern C2FIFOINT10CLR   /* 0xBF8815E4 */
  .extern C2FIFOINT10SET   /* 0xBF8815E8 */
  .extern C2FIFOINT10INV   /* 0xBF8815EC */
  .extern C2FIFOUA10       /* 0xBF8815F0 */
  .extern C2FIFOUA10CLR    /* 0xBF8815F4 */
  .extern C2FIFOUA10SET    /* 0xBF8815F8 */
  .extern C2FIFOUA10INV    /* 0xBF8815FC */
  .extern C2FIFOCI10       /* 0xBF881600 */
  .extern C2FIFOCI10CLR    /* 0xBF881604 */
  .extern C2FIFOCI10SET    /* 0xBF881608 */
  .extern C2FIFOCI10INV    /* 0xBF88160C */
  .extern C2FIFOCON11      /* 0xBF881610 */
  .extern C2FIFOCON11CLR   /* 0xBF881614 */
  .extern C2FIFOCON11SET   /* 0xBF881618 */
  .extern C2FIFOCON11INV   /* 0xBF88161C */
  .extern C2FIFOINT11      /* 0xBF881620 */
  .extern C2FIFOINT11CLR   /* 0xBF881624 */
  .extern C2FIFOINT11SET   /* 0xBF881628 */
  .extern C2FIFOINT11INV   /* 0xBF88162C */
  .extern C2FIFOUA11       /* 0xBF881630 */
  .extern C2FIFOUA11CLR    /* 0xBF881634 */
  .extern C2FIFOUA11SET    /* 0xBF881638 */
  .extern C2FIFOUA11INV    /* 0xBF88163C */
  .extern C2FIFOCI11       /* 0xBF881640 */
  .extern C2FIFOCI11CLR    /* 0xBF881644 */
  .extern C2FIFOCI11SET    /* 0xBF881648 */
  .extern C2FIFOCI11INV    /* 0xBF88164C */
  .extern C2FIFOCON12      /* 0xBF881650 */
  .extern C2FIFOCON12CLR   /* 0xBF881654 */
