Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.5.130/include/proc/p32mk0512gpe064.h
#define _IPC55_SPI4RXIS_POSITION                 0x00000010
#define _IPC55_SPI4RXIS_MASK                     0x00030000
#define _IPC55_SPI4RXIS_LENGTH                   0x00000002

#define _IPC55_SPI4RXIP_POSITION                 0x00000012
#define _IPC55_SPI4RXIP_MASK                     0x001C0000
#define _IPC55_SPI4RXIP_LENGTH                   0x00000003

#define _IPC55_SPI4TXIS_POSITION                 0x00000018
#define _IPC55_SPI4TXIS_MASK                     0x03000000
#define _IPC55_SPI4TXIS_LENGTH                   0x00000002

#define _IPC55_SPI4TXIP_POSITION                 0x0000001A
#define _IPC55_SPI4TXIP_MASK                     0x1C000000
#define _IPC55_SPI4TXIP_LENGTH                   0x00000003

#define _IPC55_w_POSITION                        0x00000000
#define _IPC55_w_MASK                            0xFFFFFFFF
#define _IPC55_w_LENGTH                          0x00000020

#define _IPC56_SPI5EIS_POSITION                  0x00000000
#define _IPC56_SPI5EIS_MASK                      0x00000003
#define _IPC56_SPI5EIS_LENGTH                    0x00000002

#define _IPC56_SPI5EIP_POSITION                  0x00000002
#define _IPC56_SPI5EIP_MASK                      0x0000001C
#define _IPC56_SPI5EIP_LENGTH                    0x00000003

#define _IPC56_SPI5RXIS_POSITION                 0x00000008
#define _IPC56_SPI5RXIS_MASK                     0x00000300
#define _IPC56_SPI5RXIS_LENGTH                   0x00000002

#define _IPC56_SPI5RXIP_POSITION                 0x0000000A
#define _IPC56_SPI5RXIP_MASK                     0x00001C00
#define _IPC56_SPI5RXIP_LENGTH                   0x00000003

#define _IPC56_SPI5TXIS_POSITION                 0x00000010
#define _IPC56_SPI5TXIS_MASK                     0x00030000
#define _IPC56_SPI5TXIS_LENGTH                   0x00000002

#define _IPC56_SPI5TXIP_POSITION                 0x00000012
#define _IPC56_SPI5TXIP_MASK                     0x001C0000
#define _IPC56_SPI5TXIP_LENGTH                   0x00000003

#define _IPC56_SPI6EIS_POSITION                  0x00000018
#define _IPC56_SPI6EIS_MASK                      0x03000000
#define _IPC56_SPI6EIS_LENGTH                    0x00000002

#define _IPC56_SPI6EIP_POSITION                  0x0000001A
#define _IPC56_SPI6EIP_MASK                      0x1C000000
#define _IPC56_SPI6EIP_LENGTH                    0x00000003

#define _IPC56_w_POSITION                        0x00000000
#define _IPC56_w_MASK                            0xFFFFFFFF
#define _IPC56_w_LENGTH                          0x00000020

#define _IPC57_SPI6RXIS_POSITION                 0x00000000
#define _IPC57_SPI6RXIS_MASK                     0x00000003
#define _IPC57_SPI6RXIS_LENGTH                   0x00000002

#define _IPC57_SPI6RXIP_POSITION                 0x00000002
#define _IPC57_SPI6RXIP_MASK                     0x0000001C
#define _IPC57_SPI6RXIP_LENGTH                   0x00000003

#define _IPC57_SPI6TXIS_POSITION                 0x00000008
#define _IPC57_SPI6TXIS_MASK                     0x00000300
#define _IPC57_SPI6TXIS_LENGTH                   0x00000002

#define _IPC57_SPI6TXIP_POSITION                 0x0000000A
#define _IPC57_SPI6TXIP_MASK                     0x00001C00
#define _IPC57_SPI6TXIP_LENGTH                   0x00000003

#define _IPC57_SBIS_POSITION                     0x00000010
#define _IPC57_SBIS_MASK                         0x00030000
#define _IPC57_SBIS_LENGTH                       0x00000002

#define _IPC57_SBIP_POSITION                     0x00000012
#define _IPC57_SBIP_MASK                         0x001C0000
#define _IPC57_SBIP_LENGTH                       0x00000003

#define _IPC57_w_POSITION                        0x00000000
#define _IPC57_w_MASK                            0xFFFFFFFF
#define _IPC57_w_LENGTH                          0x00000020

#define _IPC58_w_POSITION                        0x00000000
#define _IPC58_w_MASK                            0xFFFFFFFF
#define _IPC58_w_LENGTH                          0x00000020

#define _IPC59_w_POSITION                        0x00000000
#define _IPC59_w_MASK                            0xFFFFFFFF
#define _IPC59_w_LENGTH                          0x00000020

#define _IPC60_w_POSITION                        0x00000000
#define _IPC60_w_MASK                            0xFFFFFFFF
#define _IPC60_w_LENGTH                          0x00000020

#define _IPC61_AD1DC3IS_POSITION                 0x00000008
#define _IPC61_AD1DC3IS_MASK                     0x00000300
#define _IPC61_AD1DC3IS_LENGTH                   0x00000002

#define _IPC61_AD1DC3IP_POSITION                 0x0000000A
#define _IPC61_AD1DC3IP_MASK                     0x00001C00
#define _IPC61_AD1DC3IP_LENGTH                   0x00000003

#define _IPC61_AD1DC4IS_POSITION                 0x00000010
#define _IPC61_AD1DC4IS_MASK                     0x00030000
#define _IPC61_AD1DC4IS_LENGTH                   0x00000002

#define _IPC61_AD1DC4IP_POSITION                 0x00000012
#define _IPC61_AD1DC4IP_MASK                     0x001C0000
#define _IPC61_AD1DC4IP_LENGTH                   0x00000003

#define _IPC61_w_POSITION                        0x00000000
#define _IPC61_w_MASK                            0xFFFFFFFF
#define _IPC61_w_LENGTH                          0x00000020

#define _IPC62_w_POSITION                        0x00000000
#define _IPC62_w_MASK                            0xFFFFFFFF
#define _IPC62_w_LENGTH                          0x00000020

#define _IPC63_CPCIS_POSITION                    0x00000010
#define _IPC63_CPCIS_MASK                        0x00030000
#define _IPC63_CPCIS_LENGTH                      0x00000002

#define _IPC63_CPCIP_POSITION                    0x00000012
#define _IPC63_CPCIP_MASK                        0x001C0000
#define _IPC63_CPCIP_LENGTH                      0x00000003

#define _IPC63_CFDCIS_POSITION                   0x00000018
#define _IPC63_CFDCIS_MASK                       0x03000000
#define _IPC63_CFDCIS_LENGTH                     0x00000002

#define _IPC63_CFDCIP_POSITION                   0x0000001A
#define _IPC63_CFDCIP_MASK                       0x1C000000
#define _IPC63_CFDCIP_LENGTH                     0x00000003

#define _IPC63_w_POSITION                        0x00000000
#define _IPC63_w_MASK                            0xFFFFFFFF
#define _IPC63_w_LENGTH                          0x00000020

#define _OFF000_VOFF_POSITION                    0x00000001
#define _OFF000_VOFF_MASK                        0x0003FFFE
#define _OFF000_VOFF_LENGTH                      0x00000011

#define _OFF001_VOFF_POSITION                    0x00000001
#define _OFF001_VOFF_MASK                        0x0003FFFE
#define _OFF001_VOFF_LENGTH                      0x00000011

#define _OFF002_VOFF_POSITION                    0x00000001
#define _OFF002_VOFF_MASK                        0x0003FFFE
#define _OFF002_VOFF_LENGTH                      0x00000011

#define _OFF003_VOFF_POSITION                    0x00000001
#define _OFF003_VOFF_MASK                        0x0003FFFE
#define _OFF003_VOFF_LENGTH                      0x00000011

