Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.5.130/include/proc/p32mk0512gpe064.h
#define _DCH2INT_CHSDIE_POSITION                 0x00000017
#define _DCH2INT_CHSDIE_MASK                     0x00800000
#define _DCH2INT_CHSDIE_LENGTH                   0x00000001

#define _DCH2SSA_CHSSA_POSITION                  0x00000000
#define _DCH2SSA_CHSSA_MASK                      0xFFFFFFFF
#define _DCH2SSA_CHSSA_LENGTH                    0x00000020

#define _DCH2DSA_CHDSA_POSITION                  0x00000000
#define _DCH2DSA_CHDSA_MASK                      0xFFFFFFFF
#define _DCH2DSA_CHDSA_LENGTH                    0x00000020

#define _DCH2SSIZ_CHSSIZ_POSITION                0x00000000
#define _DCH2SSIZ_CHSSIZ_MASK                    0x0000FFFF
#define _DCH2SSIZ_CHSSIZ_LENGTH                  0x00000010

#define _DCH2DSIZ_CHDSIZ_POSITION                0x00000000
#define _DCH2DSIZ_CHDSIZ_MASK                    0x0000FFFF
#define _DCH2DSIZ_CHDSIZ_LENGTH                  0x00000010

#define _DCH2SPTR_CHSPTR_POSITION                0x00000000
#define _DCH2SPTR_CHSPTR_MASK                    0x0000FFFF
#define _DCH2SPTR_CHSPTR_LENGTH                  0x00000010

#define _DCH2DPTR_CHDPTR_POSITION                0x00000000
#define _DCH2DPTR_CHDPTR_MASK                    0x0000FFFF
#define _DCH2DPTR_CHDPTR_LENGTH                  0x00000010

#define _DCH2CSIZ_CHCSIZ_POSITION                0x00000000
#define _DCH2CSIZ_CHCSIZ_MASK                    0x0000FFFF
#define _DCH2CSIZ_CHCSIZ_LENGTH                  0x00000010

#define _DCH2CPTR_CHCPTR_POSITION                0x00000000
#define _DCH2CPTR_CHCPTR_MASK                    0x0000FFFF
#define _DCH2CPTR_CHCPTR_LENGTH                  0x00000010

#define _DCS2CPTR_CHCPTR_POSITION                0x00000000
#define _DCS2CPTR_CHCPTR_MASK                    0x0000FFFF
#define _DCS2CPTR_CHCPTR_LENGTH                  0x00000010

#define _DCH2DAT_CHPDAT_POSITION                 0x00000000
#define _DCH2DAT_CHPDAT_MASK                     0x0000FFFF
#define _DCH2DAT_CHPDAT_LENGTH                   0x00000010

#define _DCH3CON_CHPRI_POSITION                  0x00000000
#define _DCH3CON_CHPRI_MASK                      0x00000003
#define _DCH3CON_CHPRI_LENGTH                    0x00000002

#define _DCH3CON_CHEDET_POSITION                 0x00000002
#define _DCH3CON_CHEDET_MASK                     0x00000004
#define _DCH3CON_CHEDET_LENGTH                   0x00000001

#define _DCH3CON_CHAEN_POSITION                  0x00000004
#define _DCH3CON_CHAEN_MASK                      0x00000010
#define _DCH3CON_CHAEN_LENGTH                    0x00000001

#define _DCH3CON_CHCHN_POSITION                  0x00000005
#define _DCH3CON_CHCHN_MASK                      0x00000020
#define _DCH3CON_CHCHN_LENGTH                    0x00000001

#define _DCH3CON_CHAED_POSITION                  0x00000006
#define _DCH3CON_CHAED_MASK                      0x00000040
#define _DCH3CON_CHAED_LENGTH                    0x00000001

#define _DCH3CON_CHEN_POSITION                   0x00000007
#define _DCH3CON_CHEN_MASK                       0x00000080
#define _DCH3CON_CHEN_LENGTH                     0x00000001

#define _DCH3CON_CHCHNS_POSITION                 0x00000008
#define _DCH3CON_CHCHNS_MASK                     0x00000100
#define _DCH3CON_CHCHNS_LENGTH                   0x00000001

#define _DCH3CON_CHPATLEN_POSITION               0x0000000B
#define _DCH3CON_CHPATLEN_MASK                   0x00000800
#define _DCH3CON_CHPATLEN_LENGTH                 0x00000001

#define _DCH3CON_CHPIGNEN_POSITION               0x0000000D
#define _DCH3CON_CHPIGNEN_MASK                   0x00002000
#define _DCH3CON_CHPIGNEN_LENGTH                 0x00000001

#define _DCH3CON_CHBUSY_POSITION                 0x0000000F
#define _DCH3CON_CHBUSY_MASK                     0x00008000
#define _DCH3CON_CHBUSY_LENGTH                   0x00000001

#define _DCH3CON_CHPIGN_POSITION                 0x00000018
#define _DCH3CON_CHPIGN_MASK                     0xFF000000
#define _DCH3CON_CHPIGN_LENGTH                   0x00000008

#define _DCH3ECON_AIRQEN_POSITION                0x00000003
#define _DCH3ECON_AIRQEN_MASK                    0x00000008
#define _DCH3ECON_AIRQEN_LENGTH                  0x00000001

#define _DCH3ECON_SIRQEN_POSITION                0x00000004
#define _DCH3ECON_SIRQEN_MASK                    0x00000010
#define _DCH3ECON_SIRQEN_LENGTH                  0x00000001

#define _DCH3ECON_PATEN_POSITION                 0x00000005
#define _DCH3ECON_PATEN_MASK                     0x00000020
#define _DCH3ECON_PATEN_LENGTH                   0x00000001

#define _DCH3ECON_CABORT_POSITION                0x00000006
#define _DCH3ECON_CABORT_MASK                    0x00000040
#define _DCH3ECON_CABORT_LENGTH                  0x00000001

#define _DCH3ECON_CFORCE_POSITION                0x00000007
#define _DCH3ECON_CFORCE_MASK                    0x00000080
#define _DCH3ECON_CFORCE_LENGTH                  0x00000001

#define _DCH3ECON_CHSIRQ_POSITION                0x00000008
#define _DCH3ECON_CHSIRQ_MASK                    0x0000FF00
#define _DCH3ECON_CHSIRQ_LENGTH                  0x00000008

#define _DCH3ECON_CHAIRQ_POSITION                0x00000010
#define _DCH3ECON_CHAIRQ_MASK                    0x00FF0000
#define _DCH3ECON_CHAIRQ_LENGTH                  0x00000008

#define _DCH3INT_CHERIF_POSITION                 0x00000000
#define _DCH3INT_CHERIF_MASK                     0x00000001
#define _DCH3INT_CHERIF_LENGTH                   0x00000001

#define _DCH3INT_CHTAIF_POSITION                 0x00000001
#define _DCH3INT_CHTAIF_MASK                     0x00000002
#define _DCH3INT_CHTAIF_LENGTH                   0x00000001

#define _DCH3INT_CHCCIF_POSITION                 0x00000002
#define _DCH3INT_CHCCIF_MASK                     0x00000004
#define _DCH3INT_CHCCIF_LENGTH                   0x00000001

#define _DCH3INT_CHBCIF_POSITION                 0x00000003
#define _DCH3INT_CHBCIF_MASK                     0x00000008
#define _DCH3INT_CHBCIF_LENGTH                   0x00000001

#define _DCH3INT_CHDHIF_POSITION                 0x00000004
#define _DCH3INT_CHDHIF_MASK                     0x00000010
#define _DCH3INT_CHDHIF_LENGTH                   0x00000001

#define _DCH3INT_CHDDIF_POSITION                 0x00000005
#define _DCH3INT_CHDDIF_MASK                     0x00000020
#define _DCH3INT_CHDDIF_LENGTH                   0x00000001

