Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.5.130/include/proc/p32mk0512gpe064.h
#define _CNPDE_CNPDE13_POSITION                  0x0000000D
#define _CNPDE_CNPDE13_MASK                      0x00002000
#define _CNPDE_CNPDE13_LENGTH                    0x00000001

#define _CNPDE_CNPDE14_POSITION                  0x0000000E
#define _CNPDE_CNPDE14_MASK                      0x00004000
#define _CNPDE_CNPDE14_LENGTH                    0x00000001

#define _CNPDE_CNPDE15_POSITION                  0x0000000F
#define _CNPDE_CNPDE15_MASK                      0x00008000
#define _CNPDE_CNPDE15_LENGTH                    0x00000001

#define _CNPDE_w_POSITION                        0x00000000
#define _CNPDE_w_MASK                            0xFFFFFFFF
#define _CNPDE_w_LENGTH                          0x00000020

#define _CNCONE_EDGEDETECT_POSITION              0x0000000B
#define _CNCONE_EDGEDETECT_MASK                  0x00000800
#define _CNCONE_EDGEDETECT_LENGTH                0x00000001

#define _CNCONE_ON_POSITION                      0x0000000F
#define _CNCONE_ON_MASK                          0x00008000
#define _CNCONE_ON_LENGTH                        0x00000001

#define _CNCONE_w_POSITION                       0x00000000
#define _CNCONE_w_MASK                           0xFFFFFFFF
#define _CNCONE_w_LENGTH                         0x00000020

#define _CNENE_CNIEE12_POSITION                  0x0000000C
#define _CNENE_CNIEE12_MASK                      0x00001000
#define _CNENE_CNIEE12_LENGTH                    0x00000001

#define _CNENE_CNIEE13_POSITION                  0x0000000D
#define _CNENE_CNIEE13_MASK                      0x00002000
#define _CNENE_CNIEE13_LENGTH                    0x00000001

#define _CNENE_CNIEE14_POSITION                  0x0000000E
#define _CNENE_CNIEE14_MASK                      0x00004000
#define _CNENE_CNIEE14_LENGTH                    0x00000001

#define _CNENE_CNIEE15_POSITION                  0x0000000F
#define _CNENE_CNIEE15_MASK                      0x00008000
#define _CNENE_CNIEE15_LENGTH                    0x00000001

#define _CNENE_w_POSITION                        0x00000000
#define _CNENE_w_MASK                            0xFFFFFFFF
#define _CNENE_w_LENGTH                          0x00000020

#define _CNSTATE_CNSTATE12_POSITION              0x0000000C
#define _CNSTATE_CNSTATE12_MASK                  0x00001000
#define _CNSTATE_CNSTATE12_LENGTH                0x00000001

#define _CNSTATE_CNSTATE13_POSITION              0x0000000D
#define _CNSTATE_CNSTATE13_MASK                  0x00002000
#define _CNSTATE_CNSTATE13_LENGTH                0x00000001

#define _CNSTATE_CNSTATE14_POSITION              0x0000000E
#define _CNSTATE_CNSTATE14_MASK                  0x00004000
#define _CNSTATE_CNSTATE14_LENGTH                0x00000001

#define _CNSTATE_CNSTATE15_POSITION              0x0000000F
#define _CNSTATE_CNSTATE15_MASK                  0x00008000
#define _CNSTATE_CNSTATE15_LENGTH                0x00000001

#define _CNSTATE_w_POSITION                      0x00000000
#define _CNSTATE_w_MASK                          0xFFFFFFFF
#define _CNSTATE_w_LENGTH                        0x00000020

#define _CNNEE_CNNEE12_POSITION                  0x0000000C
#define _CNNEE_CNNEE12_MASK                      0x00001000
#define _CNNEE_CNNEE12_LENGTH                    0x00000001

#define _CNNEE_CNNEE13_POSITION                  0x0000000D
#define _CNNEE_CNNEE13_MASK                      0x00002000
#define _CNNEE_CNNEE13_LENGTH                    0x00000001

#define _CNNEE_CNNEE14_POSITION                  0x0000000E
#define _CNNEE_CNNEE14_MASK                      0x00004000
#define _CNNEE_CNNEE14_LENGTH                    0x00000001

#define _CNNEE_CNNEE15_POSITION                  0x0000000F
#define _CNNEE_CNNEE15_MASK                      0x00008000
#define _CNNEE_CNNEE15_LENGTH                    0x00000001

#define _CNFE_CNFE12_POSITION                    0x0000000C
#define _CNFE_CNFE12_MASK                        0x00001000
#define _CNFE_CNFE12_LENGTH                      0x00000001

#define _CNFE_CNFE13_POSITION                    0x0000000D
#define _CNFE_CNFE13_MASK                        0x00002000
#define _CNFE_CNFE13_LENGTH                      0x00000001

#define _CNFE_CNFE14_POSITION                    0x0000000E
#define _CNFE_CNFE14_MASK                        0x00004000
#define _CNFE_CNFE14_LENGTH                      0x00000001

#define _CNFE_CNFE15_POSITION                    0x0000000F
#define _CNFE_CNFE15_MASK                        0x00008000
#define _CNFE_CNFE15_LENGTH                      0x00000001

#define _SRCON0E_SR0E12_POSITION                 0x0000000C
#define _SRCON0E_SR0E12_MASK                     0x00001000
#define _SRCON0E_SR0E12_LENGTH                   0x00000001

#define _SRCON0E_SR0E13_POSITION                 0x0000000D
#define _SRCON0E_SR0E13_MASK                     0x00002000
#define _SRCON0E_SR0E13_LENGTH                   0x00000001

#define _SRCON0E_SR0E14_POSITION                 0x0000000E
#define _SRCON0E_SR0E14_MASK                     0x00004000
#define _SRCON0E_SR0E14_LENGTH                   0x00000001

#define _SRCON0E_SR0E15_POSITION                 0x0000000F
#define _SRCON0E_SR0E15_MASK                     0x00008000
#define _SRCON0E_SR0E15_LENGTH                   0x00000001

#define _SRCON1E_SR1E12_POSITION                 0x0000000C
#define _SRCON1E_SR1E12_MASK                     0x00001000
#define _SRCON1E_SR1E12_LENGTH                   0x00000001

#define _SRCON1E_SR1E13_POSITION                 0x0000000D
#define _SRCON1E_SR1E13_MASK                     0x00002000
#define _SRCON1E_SR1E13_LENGTH                   0x00000001

#define _SRCON1E_SR1E14_POSITION                 0x0000000E
#define _SRCON1E_SR1E14_MASK                     0x00004000
#define _SRCON1E_SR1E14_LENGTH                   0x00000001

#define _SRCON1E_SR1E15_POSITION                 0x0000000F
#define _SRCON1E_SR1E15_MASK                     0x00008000
#define _SRCON1E_SR1E15_LENGTH                   0x00000001

#define _TRISF_TRISF0_POSITION                   0x00000000
#define _TRISF_TRISF0_MASK                       0x00000001
#define _TRISF_TRISF0_LENGTH                     0x00000001

#define _TRISF_TRISF1_POSITION                   0x00000001
#define _TRISF_TRISF1_MASK                       0x00000002
#define _TRISF_TRISF1_LENGTH                     0x00000001

