Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.5.130/include/proc/p32mk0512gpe064.h
#define _C1RXF1_SID_POSITION                     0x00000015
#define _C1RXF1_SID_MASK                         0xFFE00000
#define _C1RXF1_SID_LENGTH                       0x0000000B

#define _C1RXF1_w_POSITION                       0x00000000
#define _C1RXF1_w_MASK                           0xFFFFFFFF
#define _C1RXF1_w_LENGTH                         0x00000020

#define _C1RXF2_EID_POSITION                     0x00000000
#define _C1RXF2_EID_MASK                         0x0003FFFF
#define _C1RXF2_EID_LENGTH                       0x00000012

#define _C1RXF2_EXID_POSITION                    0x00000013
#define _C1RXF2_EXID_MASK                        0x00080000
#define _C1RXF2_EXID_LENGTH                      0x00000001

#define _C1RXF2_SID_POSITION                     0x00000015
#define _C1RXF2_SID_MASK                         0xFFE00000
#define _C1RXF2_SID_LENGTH                       0x0000000B

#define _C1RXF2_w_POSITION                       0x00000000
#define _C1RXF2_w_MASK                           0xFFFFFFFF
#define _C1RXF2_w_LENGTH                         0x00000020

#define _C1RXF3_EID_POSITION                     0x00000000
#define _C1RXF3_EID_MASK                         0x0003FFFF
#define _C1RXF3_EID_LENGTH                       0x00000012

#define _C1RXF3_EXID_POSITION                    0x00000013
#define _C1RXF3_EXID_MASK                        0x00080000
#define _C1RXF3_EXID_LENGTH                      0x00000001

#define _C1RXF3_SID_POSITION                     0x00000015
#define _C1RXF3_SID_MASK                         0xFFE00000
#define _C1RXF3_SID_LENGTH                       0x0000000B

#define _C1RXF3_w_POSITION                       0x00000000
#define _C1RXF3_w_MASK                           0xFFFFFFFF
#define _C1RXF3_w_LENGTH                         0x00000020

#define _C1RXF4_EID_POSITION                     0x00000000
#define _C1RXF4_EID_MASK                         0x0003FFFF
#define _C1RXF4_EID_LENGTH                       0x00000012

#define _C1RXF4_EXID_POSITION                    0x00000013
#define _C1RXF4_EXID_MASK                        0x00080000
#define _C1RXF4_EXID_LENGTH                      0x00000001

#define _C1RXF4_SID_POSITION                     0x00000015
#define _C1RXF4_SID_MASK                         0xFFE00000
#define _C1RXF4_SID_LENGTH                       0x0000000B

#define _C1RXF4_w_POSITION                       0x00000000
#define _C1RXF4_w_MASK                           0xFFFFFFFF
#define _C1RXF4_w_LENGTH                         0x00000020

#define _C1RXF5_EID_POSITION                     0x00000000
#define _C1RXF5_EID_MASK                         0x0003FFFF
#define _C1RXF5_EID_LENGTH                       0x00000012

#define _C1RXF5_EXID_POSITION                    0x00000013
#define _C1RXF5_EXID_MASK                        0x00080000
#define _C1RXF5_EXID_LENGTH                      0x00000001

#define _C1RXF5_SID_POSITION                     0x00000015
#define _C1RXF5_SID_MASK                         0xFFE00000
#define _C1RXF5_SID_LENGTH                       0x0000000B

#define _C1RXF5_w_POSITION                       0x00000000
#define _C1RXF5_w_MASK                           0xFFFFFFFF
#define _C1RXF5_w_LENGTH                         0x00000020

#define _C1RXF6_EID_POSITION                     0x00000000
#define _C1RXF6_EID_MASK                         0x0003FFFF
#define _C1RXF6_EID_LENGTH                       0x00000012

#define _C1RXF6_EXID_POSITION                    0x00000013
#define _C1RXF6_EXID_MASK                        0x00080000
#define _C1RXF6_EXID_LENGTH                      0x00000001

#define _C1RXF6_SID_POSITION                     0x00000015
#define _C1RXF6_SID_MASK                         0xFFE00000
#define _C1RXF6_SID_LENGTH                       0x0000000B

#define _C1RXF6_w_POSITION                       0x00000000
#define _C1RXF6_w_MASK                           0xFFFFFFFF
#define _C1RXF6_w_LENGTH                         0x00000020

#define _C1RXF7_EID_POSITION                     0x00000000
#define _C1RXF7_EID_MASK                         0x0003FFFF
#define _C1RXF7_EID_LENGTH                       0x00000012

#define _C1RXF7_EXID_POSITION                    0x00000013
#define _C1RXF7_EXID_MASK                        0x00080000
#define _C1RXF7_EXID_LENGTH                      0x00000001

#define _C1RXF7_SID_POSITION                     0x00000015
#define _C1RXF7_SID_MASK                         0xFFE00000
#define _C1RXF7_SID_LENGTH                       0x0000000B

#define _C1RXF7_w_POSITION                       0x00000000
#define _C1RXF7_w_MASK                           0xFFFFFFFF
#define _C1RXF7_w_LENGTH                         0x00000020

#define _C1RXF8_EID_POSITION                     0x00000000
#define _C1RXF8_EID_MASK                         0x0003FFFF
#define _C1RXF8_EID_LENGTH                       0x00000012

#define _C1RXF8_EXID_POSITION                    0x00000013
#define _C1RXF8_EXID_MASK                        0x00080000
#define _C1RXF8_EXID_LENGTH                      0x00000001

#define _C1RXF8_SID_POSITION                     0x00000015
#define _C1RXF8_SID_MASK                         0xFFE00000
#define _C1RXF8_SID_LENGTH                       0x0000000B

#define _C1RXF8_w_POSITION                       0x00000000
#define _C1RXF8_w_MASK                           0xFFFFFFFF
#define _C1RXF8_w_LENGTH                         0x00000020

#define _C1RXF9_EID_POSITION                     0x00000000
#define _C1RXF9_EID_MASK                         0x0003FFFF
#define _C1RXF9_EID_LENGTH                       0x00000012

#define _C1RXF9_EXID_POSITION                    0x00000013
#define _C1RXF9_EXID_MASK                        0x00080000
#define _C1RXF9_EXID_LENGTH                      0x00000001

#define _C1RXF9_SID_POSITION                     0x00000015
#define _C1RXF9_SID_MASK                         0xFFE00000
#define _C1RXF9_SID_LENGTH                       0x0000000B

#define _C1RXF9_w_POSITION                       0x00000000
#define _C1RXF9_w_MASK                           0xFFFFFFFF
#define _C1RXF9_w_LENGTH                         0x00000020

#define _C1RXF10_EID_POSITION                    0x00000000
#define _C1RXF10_EID_MASK                        0x0003FFFF
#define _C1RXF10_EID_LENGTH                      0x00000012

#define _C1RXF10_EXID_POSITION                   0x00000013
#define _C1RXF10_EXID_MASK                       0x00080000
#define _C1RXF10_EXID_LENGTH                     0x00000001

