Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.5.130/include/proc/p32mk0512gpe064.h
#define _C1RXF10_SID_POSITION                    0x00000015
#define _C1RXF10_SID_MASK                        0xFFE00000
#define _C1RXF10_SID_LENGTH                      0x0000000B

#define _C1RXF10_w_POSITION                      0x00000000
#define _C1RXF10_w_MASK                          0xFFFFFFFF
#define _C1RXF10_w_LENGTH                        0x00000020

#define _C1RXF11_EID_POSITION                    0x00000000
#define _C1RXF11_EID_MASK                        0x0003FFFF
#define _C1RXF11_EID_LENGTH                      0x00000012

#define _C1RXF11_EXID_POSITION                   0x00000013
#define _C1RXF11_EXID_MASK                       0x00080000
#define _C1RXF11_EXID_LENGTH                     0x00000001

#define _C1RXF11_SID_POSITION                    0x00000015
#define _C1RXF11_SID_MASK                        0xFFE00000
#define _C1RXF11_SID_LENGTH                      0x0000000B

#define _C1RXF11_w_POSITION                      0x00000000
#define _C1RXF11_w_MASK                          0xFFFFFFFF
#define _C1RXF11_w_LENGTH                        0x00000020

#define _C1RXF12_EID_POSITION                    0x00000000
#define _C1RXF12_EID_MASK                        0x0003FFFF
#define _C1RXF12_EID_LENGTH                      0x00000012

#define _C1RXF12_EXID_POSITION                   0x00000013
#define _C1RXF12_EXID_MASK                       0x00080000
#define _C1RXF12_EXID_LENGTH                     0x00000001

#define _C1RXF12_SID_POSITION                    0x00000015
#define _C1RXF12_SID_MASK                        0xFFE00000
#define _C1RXF12_SID_LENGTH                      0x0000000B

#define _C1RXF12_w_POSITION                      0x00000000
#define _C1RXF12_w_MASK                          0xFFFFFFFF
#define _C1RXF12_w_LENGTH                        0x00000020

#define _C1RXF13_EID_POSITION                    0x00000000
#define _C1RXF13_EID_MASK                        0x0003FFFF
#define _C1RXF13_EID_LENGTH                      0x00000012

#define _C1RXF13_EXID_POSITION                   0x00000013
#define _C1RXF13_EXID_MASK                       0x00080000
#define _C1RXF13_EXID_LENGTH                     0x00000001

#define _C1RXF13_SID_POSITION                    0x00000015
#define _C1RXF13_SID_MASK                        0xFFE00000
#define _C1RXF13_SID_LENGTH                      0x0000000B

#define _C1RXF13_w_POSITION                      0x00000000
#define _C1RXF13_w_MASK                          0xFFFFFFFF
#define _C1RXF13_w_LENGTH                        0x00000020

#define _C1RXF14_EID_POSITION                    0x00000000
#define _C1RXF14_EID_MASK                        0x0003FFFF
#define _C1RXF14_EID_LENGTH                      0x00000012

#define _C1RXF14_EXID_POSITION                   0x00000013
#define _C1RXF14_EXID_MASK                       0x00080000
#define _C1RXF14_EXID_LENGTH                     0x00000001

#define _C1RXF14_SID_POSITION                    0x00000015
#define _C1RXF14_SID_MASK                        0xFFE00000
#define _C1RXF14_SID_LENGTH                      0x0000000B

#define _C1RXF14_w_POSITION                      0x00000000
#define _C1RXF14_w_MASK                          0xFFFFFFFF
#define _C1RXF14_w_LENGTH                        0x00000020

#define _C1RXF15_EID_POSITION                    0x00000000
#define _C1RXF15_EID_MASK                        0x0003FFFF
#define _C1RXF15_EID_LENGTH                      0x00000012

#define _C1RXF15_EXID_POSITION                   0x00000013
#define _C1RXF15_EXID_MASK                       0x00080000
#define _C1RXF15_EXID_LENGTH                     0x00000001

#define _C1RXF15_SID_POSITION                    0x00000015
#define _C1RXF15_SID_MASK                        0xFFE00000
#define _C1RXF15_SID_LENGTH                      0x0000000B

#define _C1RXF15_w_POSITION                      0x00000000
#define _C1RXF15_w_MASK                          0xFFFFFFFF
#define _C1RXF15_w_LENGTH                        0x00000020

#define _C1FIFOCON0_TXPRI_POSITION               0x00000000
#define _C1FIFOCON0_TXPRI_MASK                   0x00000003
#define _C1FIFOCON0_TXPRI_LENGTH                 0x00000002

#define _C1FIFOCON0_RTREN_POSITION               0x00000002
#define _C1FIFOCON0_RTREN_MASK                   0x00000004
#define _C1FIFOCON0_RTREN_LENGTH                 0x00000001

#define _C1FIFOCON0_TXREQ_POSITION               0x00000003
#define _C1FIFOCON0_TXREQ_MASK                   0x00000008
#define _C1FIFOCON0_TXREQ_LENGTH                 0x00000001

#define _C1FIFOCON0_TXERR_POSITION               0x00000004
#define _C1FIFOCON0_TXERR_MASK                   0x00000010
#define _C1FIFOCON0_TXERR_LENGTH                 0x00000001

#define _C1FIFOCON0_TXLARB_POSITION              0x00000005
#define _C1FIFOCON0_TXLARB_MASK                  0x00000020
#define _C1FIFOCON0_TXLARB_LENGTH                0x00000001

#define _C1FIFOCON0_TXABAT_POSITION              0x00000006
#define _C1FIFOCON0_TXABAT_MASK                  0x00000040
#define _C1FIFOCON0_TXABAT_LENGTH                0x00000001

#define _C1FIFOCON0_TXEN_POSITION                0x00000007
#define _C1FIFOCON0_TXEN_MASK                    0x00000080
#define _C1FIFOCON0_TXEN_LENGTH                  0x00000001

#define _C1FIFOCON0_DONLY_POSITION               0x0000000C
#define _C1FIFOCON0_DONLY_MASK                   0x00001000
#define _C1FIFOCON0_DONLY_LENGTH                 0x00000001

#define _C1FIFOCON0_UINC_POSITION                0x0000000D
#define _C1FIFOCON0_UINC_MASK                    0x00002000
#define _C1FIFOCON0_UINC_LENGTH                  0x00000001

#define _C1FIFOCON0_FRESET_POSITION              0x0000000E
#define _C1FIFOCON0_FRESET_MASK                  0x00004000
#define _C1FIFOCON0_FRESET_LENGTH                0x00000001

#define _C1FIFOCON0_FSIZE_POSITION               0x00000010
#define _C1FIFOCON0_FSIZE_MASK                   0x001F0000
#define _C1FIFOCON0_FSIZE_LENGTH                 0x00000005

#define _C1FIFOCON0_w_POSITION                   0x00000000
#define _C1FIFOCON0_w_MASK                       0xFFFFFFFF
#define _C1FIFOCON0_w_LENGTH                     0x00000020

#define _C1FIFOINT0_RXNEMPTYIF_POSITION          0x00000000
#define _C1FIFOINT0_RXNEMPTYIF_MASK              0x00000001
#define _C1FIFOINT0_RXNEMPTYIF_LENGTH            0x00000001

#define _C1FIFOINT0_RXHALFIF_POSITION            0x00000001
#define _C1FIFOINT0_RXHALFIF_MASK                0x00000002
#define _C1FIFOINT0_RXHALFIF_LENGTH              0x00000001

