Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.5.130/include/proc/p32mk0512gpe064.h
#define _ADCIMCON1_SIGN8_POSITION                0x00000010
#define _ADCIMCON1_SIGN8_MASK                    0x00010000
#define _ADCIMCON1_SIGN8_LENGTH                  0x00000001

#define _ADCIMCON1_DIFF8_POSITION                0x00000011
#define _ADCIMCON1_DIFF8_MASK                    0x00020000
#define _ADCIMCON1_DIFF8_LENGTH                  0x00000001

#define _ADCIMCON1_SIGN9_POSITION                0x00000012
#define _ADCIMCON1_SIGN9_MASK                    0x00040000
#define _ADCIMCON1_SIGN9_LENGTH                  0x00000001

#define _ADCIMCON1_DIFF9_POSITION                0x00000013
#define _ADCIMCON1_DIFF9_MASK                    0x00080000
#define _ADCIMCON1_DIFF9_LENGTH                  0x00000001

#define _ADCIMCON1_SIGN10_POSITION               0x00000014
#define _ADCIMCON1_SIGN10_MASK                   0x00100000
#define _ADCIMCON1_SIGN10_LENGTH                 0x00000001

#define _ADCIMCON1_DIFF10_POSITION               0x00000015
#define _ADCIMCON1_DIFF10_MASK                   0x00200000
#define _ADCIMCON1_DIFF10_LENGTH                 0x00000001

#define _ADCIMCON1_SIGN11_POSITION               0x00000016
#define _ADCIMCON1_SIGN11_MASK                   0x00400000
#define _ADCIMCON1_SIGN11_LENGTH                 0x00000001

#define _ADCIMCON1_DIFF11_POSITION               0x00000017
#define _ADCIMCON1_DIFF11_MASK                   0x00800000
#define _ADCIMCON1_DIFF11_LENGTH                 0x00000001

#define _ADCIMCON1_SIGN12_POSITION               0x00000018
#define _ADCIMCON1_SIGN12_MASK                   0x01000000
#define _ADCIMCON1_SIGN12_LENGTH                 0x00000001

#define _ADCIMCON1_DIFF12_POSITION               0x00000019
#define _ADCIMCON1_DIFF12_MASK                   0x02000000
#define _ADCIMCON1_DIFF12_LENGTH                 0x00000001

#define _ADCIMCON1_SIGN13_POSITION               0x0000001A
#define _ADCIMCON1_SIGN13_MASK                   0x04000000
#define _ADCIMCON1_SIGN13_LENGTH                 0x00000001

#define _ADCIMCON1_DIFF13_POSITION               0x0000001B
#define _ADCIMCON1_DIFF13_MASK                   0x08000000
#define _ADCIMCON1_DIFF13_LENGTH                 0x00000001

#define _ADCIMCON1_SIGN14_POSITION               0x0000001C
#define _ADCIMCON1_SIGN14_MASK                   0x10000000
#define _ADCIMCON1_SIGN14_LENGTH                 0x00000001

#define _ADCIMCON1_DIFF14_POSITION               0x0000001D
#define _ADCIMCON1_DIFF14_MASK                   0x20000000
#define _ADCIMCON1_DIFF14_LENGTH                 0x00000001

#define _ADCIMCON1_SIGN15_POSITION               0x0000001E
#define _ADCIMCON1_SIGN15_MASK                   0x40000000
#define _ADCIMCON1_SIGN15_LENGTH                 0x00000001

#define _ADCIMCON1_DIFF15_POSITION               0x0000001F
#define _ADCIMCON1_DIFF15_MASK                   0x80000000
#define _ADCIMCON1_DIFF15_LENGTH                 0x00000001

#define _ADCIMCON2_SIGN16_POSITION               0x00000000
#define _ADCIMCON2_SIGN16_MASK                   0x00000001
#define _ADCIMCON2_SIGN16_LENGTH                 0x00000001

#define _ADCIMCON2_DIFF16_POSITION               0x00000001
#define _ADCIMCON2_DIFF16_MASK                   0x00000002
#define _ADCIMCON2_DIFF16_LENGTH                 0x00000001

#define _ADCIMCON2_SIGN17_POSITION               0x00000002
#define _ADCIMCON2_SIGN17_MASK                   0x00000004
#define _ADCIMCON2_SIGN17_LENGTH                 0x00000001

#define _ADCIMCON2_DIFF17_POSITION               0x00000003
#define _ADCIMCON2_DIFF17_MASK                   0x00000008
#define _ADCIMCON2_DIFF17_LENGTH                 0x00000001

#define _ADCIMCON2_SIGN18_POSITION               0x00000004
#define _ADCIMCON2_SIGN18_MASK                   0x00000010
#define _ADCIMCON2_SIGN18_LENGTH                 0x00000001

#define _ADCIMCON2_DIFF18_POSITION               0x00000005
#define _ADCIMCON2_DIFF18_MASK                   0x00000020
#define _ADCIMCON2_DIFF18_LENGTH                 0x00000001

#define _ADCIMCON2_SIGN19_POSITION               0x00000006
#define _ADCIMCON2_SIGN19_MASK                   0x00000040
#define _ADCIMCON2_SIGN19_LENGTH                 0x00000001

#define _ADCIMCON2_DIFF19_POSITION               0x00000007
#define _ADCIMCON2_DIFF19_MASK                   0x00000080
#define _ADCIMCON2_DIFF19_LENGTH                 0x00000001

#define _ADCIMCON2_SIGN24_POSITION               0x00000010
#define _ADCIMCON2_SIGN24_MASK                   0x00010000
#define _ADCIMCON2_SIGN24_LENGTH                 0x00000001

#define _ADCIMCON2_DIFF24_POSITION               0x00000011
#define _ADCIMCON2_DIFF24_MASK                   0x00020000
#define _ADCIMCON2_DIFF24_LENGTH                 0x00000001

#define _ADCIMCON2_SIGN25_POSITION               0x00000012
#define _ADCIMCON2_SIGN25_MASK                   0x00040000
#define _ADCIMCON2_SIGN25_LENGTH                 0x00000001

#define _ADCIMCON2_DIFF25_POSITION               0x00000013
#define _ADCIMCON2_DIFF25_MASK                   0x00080000
#define _ADCIMCON2_DIFF25_LENGTH                 0x00000001

#define _ADCIMCON2_SIGN26_POSITION               0x00000014
#define _ADCIMCON2_SIGN26_MASK                   0x00100000
#define _ADCIMCON2_SIGN26_LENGTH                 0x00000001

#define _ADCIMCON2_DIFF26_POSITION               0x00000015
#define _ADCIMCON2_DIFF26_MASK                   0x00200000
#define _ADCIMCON2_DIFF26_LENGTH                 0x00000001

#define _ADCIMCON2_SIGN27_POSITION               0x00000016
#define _ADCIMCON2_SIGN27_MASK                   0x00400000
#define _ADCIMCON2_SIGN27_LENGTH                 0x00000001

#define _ADCIMCON2_DIFF27_POSITION               0x00000017
#define _ADCIMCON2_DIFF27_MASK                   0x00800000
#define _ADCIMCON2_DIFF27_LENGTH                 0x00000001

#define _ADCIMCON4_SIGN48_POSITION               0x00000000
#define _ADCIMCON4_SIGN48_MASK                   0x00000001
#define _ADCIMCON4_SIGN48_LENGTH                 0x00000001

#define _ADCIMCON4_DIFF48_POSITION               0x00000001
#define _ADCIMCON4_DIFF48_MASK                   0x00000002
#define _ADCIMCON4_DIFF48_LENGTH                 0x00000001

