Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.5.130/include/proc/p32mk0512gpe064.h
#define _SEQ_CSEQ_POSITION                       0x00000010
#define _SEQ_CSEQ_MASK                           0xFFFF0000
#define _SEQ_CSEQ_LENGTH                         0x00000010

#define _SEQ_w_POSITION                          0x00000000
#define _SEQ_w_MASK                              0xFFFFFFFF
#define _SEQ_w_LENGTH                            0x00000020

#define _DEVADC0_ADCCALDATA_POSITION             0x00000000
#define _DEVADC0_ADCCALDATA_MASK                 0xFFFFFFFF
#define _DEVADC0_ADCCALDATA_LENGTH               0x00000020

#define _DEVADC0_w_POSITION                      0x00000000
#define _DEVADC0_w_MASK                          0xFFFFFFFF
#define _DEVADC0_w_LENGTH                        0x00000020

#define _DEVADC1_ADCCALDATA_POSITION             0x00000000
#define _DEVADC1_ADCCALDATA_MASK                 0xFFFFFFFF
#define _DEVADC1_ADCCALDATA_LENGTH               0x00000020

#define _DEVADC1_w_POSITION                      0x00000000
#define _DEVADC1_w_MASK                          0xFFFFFFFF
#define _DEVADC1_w_LENGTH                        0x00000020

#define _DEVADC2_ADCCALDATA_POSITION             0x00000000
#define _DEVADC2_ADCCALDATA_MASK                 0xFFFFFFFF
#define _DEVADC2_ADCCALDATA_LENGTH               0x00000020

#define _DEVADC2_w_POSITION                      0x00000000
#define _DEVADC2_w_MASK                          0xFFFFFFFF
#define _DEVADC2_w_LENGTH                        0x00000020

#define _DEVADC3_ADCCALDATA_POSITION             0x00000000
#define _DEVADC3_ADCCALDATA_MASK                 0xFFFFFFFF
#define _DEVADC3_ADCCALDATA_LENGTH               0x00000020

#define _DEVADC3_w_POSITION                      0x00000000
#define _DEVADC3_w_MASK                          0xFFFFFFFF
#define _DEVADC3_w_LENGTH                        0x00000020

#define _DEVADC4_ADCCALDATA_POSITION             0x00000000
#define _DEVADC4_ADCCALDATA_MASK                 0xFFFFFFFF
#define _DEVADC4_ADCCALDATA_LENGTH               0x00000020

#define _DEVADC4_w_POSITION                      0x00000000
#define _DEVADC4_w_MASK                          0xFFFFFFFF
#define _DEVADC4_w_LENGTH                        0x00000020

#define _DEVADC5_ADCCALDATA_POSITION             0x00000000
#define _DEVADC5_ADCCALDATA_MASK                 0xFFFFFFFF
#define _DEVADC5_ADCCALDATA_LENGTH               0x00000020

#define _DEVADC5_w_POSITION                      0x00000000
#define _DEVADC5_w_MASK                          0xFFFFFFFF
#define _DEVADC5_w_LENGTH                        0x00000020

#define _DEVADC7_ADCCALDATA_POSITION             0x00000000
#define _DEVADC7_ADCCALDATA_MASK                 0xFFFFFFFF
#define _DEVADC7_ADCCALDATA_LENGTH               0x00000020

#define _DEVADC7_w_POSITION                      0x00000000
#define _DEVADC7_w_MASK                          0xFFFFFFFF
#define _DEVADC7_w_LENGTH                        0x00000020

#define _DEVSN0_SN_POSITION                      0x00000000
#define _DEVSN0_SN_MASK                          0xFFFFFFFF
#define _DEVSN0_SN_LENGTH                        0x00000020

#define _DEVSN0_w_POSITION                       0x00000000
#define _DEVSN0_w_MASK                           0xFFFFFFFF
#define _DEVSN0_w_LENGTH                         0x00000020

#define _DEVSN1_SN_POSITION                      0x00000000
#define _DEVSN1_SN_MASK                          0xFFFFFFFF
#define _DEVSN1_SN_LENGTH                        0x00000020

#define _DEVSN1_w_POSITION                       0x00000000
#define _DEVSN1_w_MASK                           0xFFFFFFFF
#define _DEVSN1_w_LENGTH                         0x00000020

#define _DEVSN2_SN_POSITION                      0x00000000
#define _DEVSN2_SN_MASK                          0xFFFFFFFF
#define _DEVSN2_SN_LENGTH                        0x00000020

#define _DEVSN2_w_POSITION                       0x00000000
#define _DEVSN2_w_MASK                           0xFFFFFFFF
#define _DEVSN2_w_LENGTH                         0x00000020

#define _DEVSN3_SN_POSITION                      0x00000000
#define _DEVSN3_SN_MASK                          0xFFFFFFFF
#define _DEVSN3_SN_LENGTH                        0x00000020

#define _DEVSN3_w_POSITION                       0x00000000
#define _DEVSN3_w_MASK                           0xFFFFFFFF
#define _DEVSN3_w_LENGTH                         0x00000020

#define _DEVEE0_EECALDATA_POSITION               0x00000000
#define _DEVEE0_EECALDATA_MASK                   0xFFFFFFFF
#define _DEVEE0_EECALDATA_LENGTH                 0x00000020

#define _DEVEE0_w_POSITION                       0x00000000
#define _DEVEE0_w_MASK                           0xFFFFFFFF
#define _DEVEE0_w_LENGTH                         0x00000020

#define _DEVEE1_EECALDATA_POSITION               0x00000000
#define _DEVEE1_EECALDATA_MASK                   0xFFFFFFFF
#define _DEVEE1_EECALDATA_LENGTH                 0x00000020

#define _DEVEE1_w_POSITION                       0x00000000
#define _DEVEE1_w_MASK                           0xFFFFFFFF
#define _DEVEE1_w_LENGTH                         0x00000020

#define _DEVEE2_EECALDATA_POSITION               0x00000000
#define _DEVEE2_EECALDATA_MASK                   0xFFFFFFFF
#define _DEVEE2_EECALDATA_LENGTH                 0x00000020

#define _DEVEE2_w_POSITION                       0x00000000
#define _DEVEE2_w_MASK                           0xFFFFFFFF
#define _DEVEE2_w_LENGTH                         0x00000020

#define _DEVEE3_EECALDATA_POSITION               0x00000000
#define _DEVEE3_EECALDATA_MASK                   0xFFFFFFFF
#define _DEVEE3_EECALDATA_LENGTH                 0x00000020

#define _DEVEE3_w_POSITION                       0x00000000
#define _DEVEE3_w_MASK                           0xFFFFFFFF
#define _DEVEE3_w_LENGTH                         0x00000020

#define _UBADEVCFG3_USERID_POSITION              0x00000000
#define _UBADEVCFG3_USERID_MASK                  0x0000FFFF
#define _UBADEVCFG3_USERID_LENGTH                0x00000010

#define _UBADEVCFG3_FUSBIDIO2_POSITION           0x00000016
#define _UBADEVCFG3_FUSBIDIO2_MASK               0x00400000
#define _UBADEVCFG3_FUSBIDIO2_LENGTH             0x00000001

#define _UBADEVCFG3_FVBUSIO2_POSITION            0x00000017
#define _UBADEVCFG3_FVBUSIO2_MASK                0x00800000
#define _UBADEVCFG3_FVBUSIO2_LENGTH              0x00000001

